<?xml version="1.0" encoding="UTF-8"?><rss xmlns:dc="http://purl.org/dc/elements/1.1/" xmlns:content="http://purl.org/rss/1.0/modules/content/" xmlns:atom="http://www.w3.org/2005/Atom" version="2.0" xmlns:media="http://search.yahoo.com/mrss/"><channel><title><![CDATA[SREDevOps.org]]></title><description><![CDATA[Noticias, Tutoriales, Información y Comunidad DevOps, Site Reliability Engineering (SRE) y Platform Engineering en Español]]></description><link>https://sredevops.org/</link><image><url>https://sredevops.org/favicon.png</url><title>SREDevOps.org</title><link>https://sredevops.org/</link></image><generator>Ghost 5.59</generator><lastBuildDate>Sun, 20 Aug 2023 00:02:30 GMT</lastBuildDate><atom:link href="https://sredevops.org/rss/" rel="self" type="application/rss+xml"/><ttl>60</ttl><item><title><![CDATA[Corrupción? Burocracia? Participación? Hay una solución: Blockchain.]]></title><description><![CDATA[<p>Blockchain es una tecnolog&#xED;a que est&#xE1; revolucionando el mundo, y el gobierno no es la excepci&#xF3;n. Esta tecnolog&#xED;a tiene el potencial de <strong>resolver los conflictos sociales y pol&#xED;ticos</strong>, como la<strong> corrupci&#xF3;n, la burocracia y la falta de participaci&#xF3;</strong></p>]]></description><link>https://sredevops.org/corrupcion-burocracia-participacion-hay-una-solucion-blockchain/</link><guid isPermaLink="false">64d4e1da6085e50001d85efb</guid><category><![CDATA[Columnas]]></category><category><![CDATA[SREDevOps]]></category><dc:creator><![CDATA[Nicolás Georger]]></dc:creator><pubDate>Thu, 10 Aug 2023 14:15:51 GMT</pubDate><media:content url="https://sredevops.org/content/images/2023/08/image-2-1.png" medium="image"/><content:encoded><![CDATA[<img src="https://sredevops.org/content/images/2023/08/image-2-1.png" alt="Corrupci&#xF3;n? Burocracia? Participaci&#xF3;n? Hay una soluci&#xF3;n: Blockchain."><p>Blockchain es una tecnolog&#xED;a que est&#xE1; revolucionando el mundo, y el gobierno no es la excepci&#xF3;n. Esta tecnolog&#xED;a tiene el potencial de <strong>resolver los conflictos sociales y pol&#xED;ticos</strong>, como la<strong> corrupci&#xF3;n, la burocracia y la falta de participaci&#xF3;n ciudadana</strong>.</p>
<h2 id="tabla-de-contenidos">Tabla de contenidos:</h2>
<ul>
<li><strong>C&#xF3;mo blockchain se puede usar en el gobierno?</strong></li>
<li><strong>Por qu&#xE9; es conveniente para empresas, gobiernos y principalmente la ciudadan&#xED;a?</strong></li>
<li><strong>Existe actualmente ejemplos donde ya se utilice?</strong></li>
<li><strong>Si soy desarrollador, de qu&#xE9; forma puedo especializarme en blockchain?</strong></li>
<li><strong>Si soy funcionario p&#xFA;blico, c&#xF3;mo puedo entender mejor y promover el uso de blockchain?</strong></li>
</ul>

<h2 id="c%C3%B3mo-blockchain-se-puede-usar-en-el-gobierno">C&#xF3;mo blockchain se puede usar en el gobierno?</h2>
<p>Blockchain se puede usar en el gobierno de muchas maneras, dentro de la idea central de &quot;accountability&quot;,, algunas formas son:</p>
<ul><li><strong>Para almacenar, distribuir y almacenar actos administrativos:</strong> Blockchain puede ser utilizado para registrar y gestionar documentos gubernamentales, como actas de nacimiento, registros de propiedad y registros de votaci&#xF3;n. Esto puede ayudar a reducir la corrupci&#xF3;n y garantizar que los documentos sean precisos, p&#xFA;blicos, transparentes y seguros.</li><li><strong>Para mejorar la eficiencia del gobierno:</strong> Blockchain puede ser utilizado para mejorar la eficiencia del gobierno al automatizar procesos y eliminar la necesidad de intermediarios. Esto puede ahorrar recursos p&#xFA;blicos,  simplificar tr&#xE1;mites a la ciudadan&#xED;a y garantizar confiabilidad en dichos procesos.</li><li><strong>Para aumentar la participaci&#xF3;n ciudadana:</strong> Blockchain puede ser utilizado para aumentar la participaci&#xF3;n ciudadana al permitir que todas las personas sean parte del control, tanto en los recursos , como en los cumplimientos de promesas de campa&#xF1;as,  acceder y participar en procesos gubernamentales de manera simple y notoriamente eficiente. Esto puede ayudar a hacer que los gobiernos y el Estado sea m&#xE1;s transparente y responsable ante la ciudadan&#xED;a.</li></ul>
<h2 id="por-qu%C3%A9-es-conveniente-para-empresas-gobiernos-y-principalmente-la-ciudadan%C3%ADa">Por qu&#xE9; es conveniente para empresas, gobiernos y principalmente la ciudadan&#xED;a?</h2>
<ul><li><strong>Transparencia:</strong> Blockchain es una tecnolog&#xED;a transparente, lo que significa que todas las transacciones se registran y almacenan de forma p&#xFA;blica. Esto puede ayudar a prevenir la corrupci&#xF3;n y garantizar que las transacciones sean justas y equitativas.</li><li><strong>Seguridad:</strong> Blockchain es una tecnolog&#xED;a segura, ya que utiliza criptograf&#xED;a para proteger los datos. Esto puede ayudar a prevenir el robo de datos y el fraude.</li><li><strong>Eficiencia:</strong> Blockchain es una tecnolog&#xED;a eficiente, ya que puede automatizar procesos y eliminar la necesidad de intermediarios, es decir tr&#xE1;mites y burocracia.</li></ul>
<h2 id="existe-actualmente-ejemplos-donde-ya-se-utilice">Existe actualmente ejemplos donde ya se utilice?</h2>
<p>Blockchain ya se est&#xE1; utilizando en el gobierno de varias formas, incluyendo:</p>
<ul><li><strong>&#x1F1EA;&#x1F1EA; Estonia:</strong> Estonia es uno de los pa&#xED;ses l&#xED;deres en el uso de blockchain en el gobierno. El gobierno estonio utiliza blockchain para registrar y gestionar documentos gubernamentales, como actas de nacimiento, registros de propiedad y registros de votaci&#xF3;n.</li><li><strong>&#x1F1E6;&#x1F1EA; Dubai:</strong> Dubai es otro pa&#xED;s que est&#xE1; adoptando blockchain en el gobierno. El gobierno de Dubai planea utilizar blockchain para crear una ciudad inteligente, donde los ciudadanos puedan acceder a los servicios gubernamentales de manera segura y eficiente.</li><li><strong>&#x1F1FA;&#x1F1F8; Estados Unidos:</strong>  Distintos gobiernos locales, tanto como el federal en Estados Unidos est&#xE1;n utilizando blockchain para registrar y gestionar registros de propiedad, contratos gubernamentales y registros de votaci&#xF3;n.</li></ul>
<h2 id="si-soy-desarrollador-de-qu%C3%A9-forma-puedo-especializarme-en-blockchain">Si soy desarrollador, de qu&#xE9; forma puedo especializarme en blockchain?</h2>
<ul><li><strong>Aprende sobre el funcionamiento interno de blockchain.</strong> Esto incluye entender c&#xF3;mo funcionan los bloques, las cadenas y la criptograf&#xED;a. Si est&#xE1;s interesado en realizar casos de ejemplo, <a href="https://discord.com/invite/bK9rXFTvpk?ref=sredevops.org">escr&#xED;benos y podremos realizar hackathons en nuestra comunidad Discord</a>.</li><li><strong>Construye proyectos de blockchain.</strong> Esto es una de las mejores maneras de aprender sobre la tecnolog&#xED;a y desarrollar tus habilidades. Hay muchos proyectos diferentes que puedes construir, como aplicaciones descentralizadas, redes de pagos y plataformas de contratos inteligentes.</li><li><strong>&#xDA;nete a comunidades de blockchain.</strong> Hay muchas comunidades en l&#xED;nea y en persona donde puedes conectarte con otros desarrolladores de blockchain. Estas comunidades pueden ser una gran fuente de apoyo y aprendizaje.</li><li><strong>Mantente al d&#xED;a con las &#xFA;ltimas noticias de blockchain.</strong> La tecnolog&#xED;a blockchain est&#xE1; en constante evoluci&#xF3;n, por lo que es importante mantenerse al d&#xED;a con las &#xFA;ltimas noticias. Puedes hacerlo leyendo publicaciones de blog, viendo videos y asistiendo a conferencias.</li></ul>
<h2 id="si-soy-funcionario-p%C3%BAblico-c%C3%B3mo-puedo-entender-mejor-y-promover-el-uso-de-blockchain">Si soy funcionario p&#xFA;blico, c&#xF3;mo puedo entender mejor y promover el uso de blockchain?</h2>
<ul><li><strong>Aprende sobre los beneficios de blockchain.</strong> Blockchain tiene el potencial de mejorar la eficiencia, la transparencia y la seguridad de muchos procesos gubernamentales. Puedes aprender sobre los beneficios leyendo libros, art&#xED;culos y viendo videos.</li><li><strong>Conecta con otros funcionarios p&#xFA;blicos que est&#xE1;n interesados en blockchain.</strong> Hay muchas comunidades en l&#xED;nea y en persona donde puedes conectarte con otros funcionarios p&#xFA;blicos que est&#xE1;n interesados en blockchain. Estas comunidades pueden ser una gran fuente de apoyo y aprendizaje.</li><li><strong>Desarrolla una estrategia para el uso de blockchain en tu gobierno.</strong> Una vez que entiendas los beneficios de blockchain, puedes empezar a desarrollar una estrategia para su uso en tu gobierno. Esta estrategia debe ser espec&#xED;fica para tu gobierno y debe tener en cuenta los desaf&#xED;os y oportunidades &#xFA;nicos de tu comunidad.</li><li><strong>Implementa blockchain en tu gobierno.</strong> Una vez que tengas una estrategia, puedes empezar a implementar blockchain en tu gobierno. Esto puede implicar trabajar con desarrolladores para construir aplicaciones de blockchain, o puede implicar trabajar con otros funcionarios p&#xFA;blicos para cambiar los procesos gubernamentales.</li></ul>
<p>Debemos ser parte de la soluci&#xF3;n, te invitamos a proponer ideas y participar con nosotros en Discord, todos podemos aprender, no necesitas ser experta/o.</p>
<div class="kg-card kg-file-card"><a class="kg-file-card-container" href="https://sredevops.org/content/files/2023/08/Blockchain_en_la_administracion_publica.pdf" title="Download" download><div class="kg-file-card-contents"><div class="kg-file-card-title">Blockchain_en_la_administracion_publica</div><div class="kg-file-card-caption"></div><div class="kg-file-card-metadata"><div class="kg-file-card-filename">Blockchain_en_la_administracion_publica.pdf</div><div class="kg-file-card-filesize">683 KB</div></div></div><div class="kg-file-card-icon"><svg viewbox="0 0 24 24"><defs><style>.a{fill:none;stroke:currentColor;stroke-linecap:round;stroke-linejoin:round;stroke-width:1.5px;}</style></defs><title>download-circle</title><polyline class="a" points="8.25 14.25 12 18 15.75 14.25"/><line class="a" x1="12" y1="6.75" x2="12" y2="18"/><circle class="a" cx="12" cy="12" r="11.25"/></svg></div></a></div>
<figure class="kg-card kg-image-card"><img src="https://sredevops.org/content/images/2023/08/blockchain-graphic-g2--1-.jpg" class="kg-image" alt="Corrupci&#xF3;n? Burocracia? Participaci&#xF3;n? Hay una soluci&#xF3;n: Blockchain." loading="lazy" width="1920" height="1198" srcset="https://sredevops.org/content/images/size/w600/2023/08/blockchain-graphic-g2--1-.jpg 600w, https://sredevops.org/content/images/size/w1000/2023/08/blockchain-graphic-g2--1-.jpg 1000w, https://sredevops.org/content/images/size/w1600/2023/08/blockchain-graphic-g2--1-.jpg 1600w, https://sredevops.org/content/images/2023/08/blockchain-graphic-g2--1-.jpg 1920w" sizes="(min-width: 720px) 720px"></figure>
<p></p>]]></content:encoded></item><item><title><![CDATA[Albert-László Barabási: las redes subyacentes y ocultas detrás de toda nuestra realidad]]></title><description><![CDATA[<figure class="kg-card kg-embed-card"><iframe width="200" height="113" src="https://www.youtube.com/embed/RfgjHoVCZwU?feature=oembed" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" allowfullscreen title="The hidden networks of everything | Albert-L&#xE1;szl&#xF3; Barab&#xE1;si"></iframe></figure>
<p>En nuestro mundo abundan los datos.<strong> Albert-L&#xE1;szl&#xF3; Barab&#xE1;s</strong>i, cient&#xED;fico, matem&#xE1;tico, pionero en <strong>data science, </strong>plantea que es crucial comprender las estructuras subyacentes y las relaciones entre sistemas complejos. Las investigaciones de Barab&#xE1;si han puesto en entredicho la noci&</p>]]></description><link>https://sredevops.org/albert-laszlo-barabasi-las-redes-subyacentes-y-ocultas-detras-de-toda-nuestra-realidad/</link><guid isPermaLink="false">64ba3fb584682c0001dc718d</guid><category><![CDATA[Videos]]></category><category><![CDATA[Cortos]]></category><category><![CDATA[Destacado]]></category><category><![CDATA[Data Science]]></category><dc:creator><![CDATA[Nicolás Georger]]></dc:creator><pubDate>Fri, 21 Jul 2023 08:34:19 GMT</pubDate><media:content url="https://sredevops.org/content/images/2023/08/maxresdefault.webp" medium="image"/><content:encoded><![CDATA[<figure class="kg-card kg-embed-card"><iframe width="200" height="113" src="https://www.youtube.com/embed/RfgjHoVCZwU?feature=oembed" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" allowfullscreen title="The hidden networks of everything | Albert-L&#xE1;szl&#xF3; Barab&#xE1;si"></iframe></figure>
<img src="https://sredevops.org/content/images/2023/08/maxresdefault.webp" alt="Albert-L&#xE1;szl&#xF3; Barab&#xE1;si: las redes subyacentes y ocultas detr&#xE1;s de toda nuestra realidad"><p>En nuestro mundo abundan los datos.<strong> Albert-L&#xE1;szl&#xF3; Barab&#xE1;s</strong>i, cient&#xED;fico, matem&#xE1;tico, pionero en <strong>data science, </strong>plantea que es crucial comprender las estructuras subyacentes y las relaciones entre sistemas complejos. Las investigaciones de Barab&#xE1;si han puesto en entredicho la noci&#xF3;n de conexiones aleatorias y han permitido descubrir una representaci&#xF3;n m&#xE1;s exacta de c&#xF3;mo se organizan estos sistemas.</p>
<p>La exploraci&#xF3;n de Barab&#xE1;si comenz&#xF3; en el comienzo de Internet y la World Wide Web. Sorprendentemente, descubri&#xF3; que la intrincada red de conexiones no segu&#xED;a patrones aleatorios, sino una distribuci&#xF3;n de la carga de energ&#xED;a. Llam&#xF3; a estas redes &quot;redes sin escala&quot;.</p>
<p>El revolucionario trabajo de Barab&#xE1;si revela que las nuevas conexiones en nuestras redes tienden a formarse con elementos ya bien conectados. Las redes sin escala existen en varios sistemas complejos, como las interacciones celulares y las redes sociales. Este descubrimiento es un paso importante hacia la comprensi&#xF3;n de la notable complejidad que surge de las innumerables interacciones entre los numerosos componentes del mundo.</p>]]></content:encoded></item><item><title><![CDATA[Cómo puedo almacenar archivos en Kubernetes? CubeFS es una excelente opción]]></title><description><![CDATA[<p></p>
<figure class="kg-card kg-image-card"><img src="https://cubefs.io/assets/k8s-component.d9c57140.png" class="kg-image" alt="image" loading="lazy"></figure>
<p><a href="https://cubefs.io/docs/master/deploy/k8s.html?ref=sredevops.org#deployment-architecture">https://cubefs.io/docs/master/deploy/k8s.html#deployment-architecture</a></p>

<p></p>
<h2 id="%C2%BFqu%C3%A9-es-cubefs">&#xBF;Qu&#xE9; es CubeFS?</h2>
<p>CubeFS es un producto de almacenamiento cloud-native, siendo uno de los proyectos en grado &quot;Incubator&quot; de la CNCF ( <a href="https://www.cncf.io/projects/cubefs/?ref=sredevops.org">Cloud Native Computing Foundation</a>).  Es compatible con varios protocolos de acceso a datos, como <strong>S3, POSIX</strong></p>]]></description><link>https://sredevops.org/como-puedo-almacenar-archivos-en-kubernetes-cubefs-es-una-excelente-opcion/</link><guid isPermaLink="false">64b6644dcd13ae00011c2bfa</guid><category><![CDATA[Kubernetes]]></category><category><![CDATA[DevOps]]></category><category><![CDATA[Cloud]]></category><category><![CDATA[Storage]]></category><dc:creator><![CDATA[Nicolás Georger]]></dc:creator><pubDate>Tue, 18 Jul 2023 15:24:41 GMT</pubDate><media:content url="https://sredevops.org/content/images/2023/07/Screenshot-2023-07-18-at-11.23.32.png" medium="image"/><content:encoded><![CDATA[<img src="https://sredevops.org/content/images/2023/07/Screenshot-2023-07-18-at-11.23.32.png" alt="C&#xF3;mo puedo almacenar archivos en Kubernetes? CubeFS es una excelente opci&#xF3;n"><p></p>
<figure class="kg-card kg-image-card"><img src="https://cubefs.io/assets/k8s-component.d9c57140.png" class="kg-image" alt="C&#xF3;mo puedo almacenar archivos en Kubernetes? CubeFS es una excelente opci&#xF3;n" loading="lazy"></figure>
<p><a href="https://cubefs.io/docs/master/deploy/k8s.html?ref=sredevops.org#deployment-architecture">https://cubefs.io/docs/master/deploy/k8s.html#deployment-architecture</a></p>

<p></p>
<h2 id="%C2%BFqu%C3%A9-es-cubefs">&#xBF;Qu&#xE9; es CubeFS?</h2>
<p>CubeFS es un producto de almacenamiento cloud-native, siendo uno de los proyectos en grado &quot;Incubator&quot; de la CNCF ( <a href="https://www.cncf.io/projects/cubefs/?ref=sredevops.org">Cloud Native Computing Foundation</a>).  Es compatible con varios protocolos de acceso a datos, como <strong>S3, POSIX y HDFS,</strong> y admite dos <em>motores de almacenamiento</em>: m&#xFA;ltiples r&#xE9;plicas y <a href="https://blog.min.io/erasure-coding/?ref=sredevops.org">erasure code</a>. Brinda a los usuarios m&#xFA;ltiples funciones, como multiusuario, implementaci&#xF3;n multi-AZ y replicaci&#xF3;n entre regiones, y se usa ampliamente en escenarios como big data, IA, plataformas de contenedores, bases de datos, almacenamiento de middleware y separaci&#xF3;n inform&#xE1;tica, uso compartido de datos y protecci&#xF3;n de Datos.</p>
<h2 id="%C2%BFpor-qu%C3%A9-cubefs">&#xBF;Por qu&#xE9; CubeFS?</h2>
<h3 id="multiprotocolo">Multiprotocolo</h3>
<p>Compatible con diversos protocolos de acceso como S3, POSIX y HDFS, y el acceso entre protocolos es interoperable.</p>
<ul><li><strong>Compatible con POSIX</strong>: Compatible con la interfaz POSIX, lo que hace que el desarrollo de aplicaciones sea extremadamente simple para aplicaciones de capa superior, tan conveniente como usar un sistema de archivos local. Adem&#xE1;s, CubeFS relaj&#xF3; los requisitos de coherencia de la sem&#xE1;ntica POSIX durante la implementaci&#xF3;n para equilibrar el rendimiento de las operaciones de archivos y metadatos.</li><li><strong>Compatible con S3</strong>: compatible con el protocolo de almacenamiento de objetos de AWS S3, los usuarios pueden usar el SDK nativo de Amazon S3 para administrar recursos en CubeFS.</li><li><strong>Compatible con HDFS</strong>: Compatible con el protocolo de interfaz Hadoop FileSystem, los usuarios pueden usar CubeFS para reemplazar el sistema de archivos Hadoop (HDFS) sin afectar el negocio de capa superior.</li></ul>
<h3 id="multimotor">Multimotor</h3>
<p>Al admitir dos motores: m&#xFA;ltiples r&#xE9;plicas y codificaci&#xF3;n de borrado, los usuarios pueden elegir de manera flexible de acuerdo con sus escenarios comerciales.</p>
<ul><li><strong>Motor de almacenamiento de m&#xFA;ltiples r&#xE9;plicas</strong>: los datos entre copias est&#xE1;n en una relaci&#xF3;n de espejo y la coherencia de los datos entre copias se garantiza a trav&#xE9;s de un protocolo de replicaci&#xF3;n muy coherente. Los usuarios pueden configurar de manera flexible diferentes n&#xFA;meros de copias seg&#xFA;n los escenarios de su aplicaci&#xF3;n.</li><li><strong>Motor de almacenamiento de codificaci&#xF3;n de borrado</strong>&#xFF1A;El motor de codificaci&#xF3;n de borrado tiene las caracter&#xED;sticas de alta confiabilidad, alta disponibilidad, bajo costo y admite escala ultra grande (EB). De acuerdo con los diferentes modelos AZ, los modos de codificaci&#xF3;n de borrado se pueden seleccionar de manera flexible.</li></ul>
<h3 id="multiusuario">Multiusuario</h3>
<p>Apoyar la administraci&#xF3;n de m&#xFA;ltiples inquilinos y proporcionar pol&#xED;ticas detalladas de aislamiento de inquilinos.</p>
<h3 id="altamente-escalable">Altamente escalable</h3>
<p>Puede construir f&#xE1;cilmente servicios de almacenamiento distribuido con escala de nivel PB o EB, y cada m&#xF3;dulo se puede escalar horizontalmente.</p>
<h3 id="alto-rendimiento">Alto rendimiento</h3>
<p>CubeFS admite el almacenamiento en cach&#xE9; de varios niveles para optimizar el acceso a archivos peque&#xF1;os y admite m&#xFA;ltiples protocolos de replicaci&#xF3;n de alto rendimiento.</p>
<ul><li><strong>Gesti&#xF3;n de metadatos</strong>: el cl&#xFA;ster de metadatos usa almacenamiento de metadatos en memoria y utiliza dos &#xE1;rboles B (inodeBTree y dentryBTree) para administrar &#xED;ndices y mejorar el rendimiento del acceso a los metadatos.</li><li><strong>Protocolo de replicaci&#xF3;n de consistencia s&#xF3;lida</strong>&#xFF1A;CubeFS adopta diferentes protocolos de replicaci&#xF3;n de acuerdo con el modo de escritura del archivo para garantizar la consistencia de los datos entre las r&#xE9;plicas. Si el archivo se escribe secuencialmente, se utiliza el protocolo de replicaci&#xF3;n principal-respaldo para optimizar el rendimiento de E/S. Si el archivo se escribe aleatoriamente para sobrescribir el contenido del archivo existente, se utiliza un protocolo de replicaci&#xF3;n basado en Multi-Raft para garantizar una gran coherencia de los datos.</li><li><strong>Almacenamiento en cach&#xE9; de niveles m&#xFA;ltiples</strong>: el volumen de codificaci&#xF3;n de borrado admite la capacidad de aceleraci&#xF3;n de almacenamiento en cach&#xE9; de niveles m&#xFA;ltiples para proporcionar un mayor rendimiento de acceso a datos para datos calientes:<ul><li>Cach&#xE9; local: el componente BlockCache se puede implementar en la m&#xE1;quina cliente como un cach&#xE9; local utilizando el disco local. Puede leer directamente la memoria cach&#xE9; local sin pasar por la red, pero la capacidad est&#xE1; limitada por el disco local.</li><li>Cach&#xE9; global: una cach&#xE9; global distribuida creada con el componente de r&#xE9;plica DataNode. Por ejemplo, un DataNode con un disco SSD implementado en el mismo centro de datos que el cliente se puede usar como cach&#xE9; global. En comparaci&#xF3;n con el cach&#xE9; local, debe pasar por la red, pero tiene una mayor capacidad y se puede escalar din&#xE1;micamente, y se puede ajustar la cantidad de r&#xE9;plicas.</li></ul></li></ul>
<h2 id="cloud-native">Cloud Native</h2>
<p>Basado en el standard CSI <a href="https://kubernetes.io/blog/2019/01/15/container-storage-interface-ga/?ref=sredevops.org">(Container Storage Interface</a>) , CubeFS se integra y despliega f&#xE1;cilmente en Kubernetes..</p>
<h2 id="casos-y-escenarios-de-uso">Casos y escenarios de uso</h2>
<p>Como plataforma de almacenamiento distribuido nativa de la nube, CubeFS proporciona m&#xFA;ltiples protocolos de acceso, por lo que puedes utilizarlo en distintas situaciiones, enumeremos:;</p>
<figure class="kg-card kg-image-card"><img src="https://raw.githubusercontent.com/cubefs/cubefs/master/docs/source/pic/cfs-arch-ec.png" class="kg-image" alt="C&#xF3;mo puedo almacenar archivos en Kubernetes? CubeFS es una excelente opci&#xF3;n" loading="lazy"></figure>
<h3 id="an%C3%A1lisis-de-grandes-datos">An&#xE1;lisis de grandes datos</h3>
<p>Compatible con el protocolo HDFS, CubeFS proporciona una base de almacenamiento unificado para el ecosistema Hadoop (como Spark y Hive), proporcionando espacio de almacenamiento ilimitado y capacidades de almacenamiento de datos de gran ancho de banda para motores inform&#xE1;ticos.</p>
<h3 id="deep-learningmachine-learning">Deep Learning/Machine Learning</h3>
<p>Como sistema de archivos paralelos distribuidos, CubeFS es compatible con el entrenamiento de IA, el almacenamiento y la distribuci&#xF3;n de modelos, la aceleraci&#xF3;n de E/S y otros requisitos.</p>
<h3 id="almacenamiento-compartido-entre-contenedores">Almacenamiento compartido entre contenedores</h3>
<p>El cl&#xFA;ster de contenedores puede almacenar los archivos de configuraci&#xF3;n o los datos de carga de inicializaci&#xF3;n de las im&#xE1;genes de contenedores en CubeFS, y leerlos en tiempo real cuando se cargan contenedores por lotes. M&#xFA;ltiples PODs pueden compartir datos persistentes a trav&#xE9;s de CubeFS, y se puede realizar una r&#xE1;pida conmutaci&#xF3;n por error en caso de fallo del POD.<br></p>
<h3 id="bases-de-datos-y-middleware">Bases de datos y middleware</h3>
<p>Proporciona servicios de disco en nube de alta concurrencia y baja latencia para aplicaciones de bases de datos como MySQL, ElasticSearch y ClickHouse, consiguiendo una separaci&#xF3;n completa entre almacenamiento e inform&#xE1;tica.</p>
<p>Servicios en l&#xED;nea</p>
<p>Proporciona servicios de almacenamiento de objetos de alta fiabilidad y bajo coste para negocios en l&#xED;nea (como publicidad, secuencias de clics y b&#xFA;squedas) o contenidos gr&#xE1;ficos, de texto, audio y v&#xED;deo de usuarios finales.<br><br>De NAS (Network Attached Storage)  a la nube<br>Sustituye el almacenamiento local tradicional y el NAS sin conexi&#xF3;n y facilita estrategias en cloud adoption.</p>
<p>Fuente: </p>
<p><a href="https://cubefs.io/docs/master/overview/introduction.html?ref=sredevops.org#database-middleware">https://cubefs.io/docs/master/overview/introduction.html#database-middleware</a></p>
<p></p>]]></content:encoded></item><item><title><![CDATA[¿Qué es DVC (Data Version Control)  y cómo puede ayudar en tus proyectos de datos?]]></title><description><![CDATA[<p>DVC es una herramienta gratuita y de c&#xF3;digo abierto para el control de versiones de datos. Te ayuda a administrar, rastrear y compartir conjuntos de datos a lo largo de su ciclo de vida. DVC se puede utilizar para almacenar conjuntos de datos en cualquier formato, incluidos archivos</p>]]></description><link>https://sredevops.org/que-es-dvc-data-version-control-y-como-puede-ayudar-en-tus-proyectos-de-datos/</link><guid isPermaLink="false">64b56e75cd13ae00011c2bcc</guid><category><![CDATA[MLOps]]></category><category><![CDATA[Apps]]></category><dc:creator><![CDATA[Nicolás Georger]]></dc:creator><pubDate>Mon, 17 Jul 2023 16:54:04 GMT</pubDate><media:content url="https://sredevops.org/content/images/2023/07/68747470733a2f2f6476632e6f72672f696d672f6c6f676f2d6769746875622d726561646d652e706e67.png" medium="image"/><content:encoded><![CDATA[<img src="https://sredevops.org/content/images/2023/07/68747470733a2f2f6476632e6f72672f696d672f6c6f676f2d6769746875622d726561646d652e706e67.png" alt="&#xBF;Qu&#xE9; es DVC (Data Version Control)  y c&#xF3;mo puede ayudar en tus proyectos de datos?"><p>DVC es una herramienta gratuita y de c&#xF3;digo abierto para el control de versiones de datos. Te ayuda a administrar, rastrear y compartir conjuntos de datos a lo largo de su ciclo de vida. DVC se puede utilizar para almacenar conjuntos de datos en cualquier formato, incluidos archivos CSV, JSON, HDF5 y formatos de almacenamiento de im&#xE1;genes. Tambi&#xE9;n puedes usar DVC para rastrear cambios en tus conjuntos de datos, lo que facilita la comparaci&#xF3;n de versiones y la identificaci&#xF3;n de cambios.</p>
<p><em>Podr&#xED;a decirse que DVC es un equivalente a Git, focalizado en data science. </em></p>
<p>DVC se puede usar en una variedad de escenarios y &#xE1;reas, incluyendo MLOps, data pipelines, investigaci&#xF3;n, desarrollo,  ingenier&#xED;a, bases de datos, etc. Es una herramienta poderosa que puede ayudarte a administrar y compartir tus datos de manera m&#xE1;s eficiente.</p>
<figure class="kg-card kg-bookmark-card kg-card-hascaption"><a class="kg-bookmark-container" href="https://dvc.org/?ref=sredevops.org#use-cases"><div class="kg-bookmark-content"><div class="kg-bookmark-title">Data Version Control &#xB7; DVC</div><div class="kg-bookmark-description">Open-source version control system for Data Science and Machine Learning projects. Git-like experience to organize your data, models, and experiments.</div><div class="kg-bookmark-metadata"><img class="kg-bookmark-icon" src="https://dvc.org/apple-touch-icon-512x512.png?v=dfbc4a93a926127fc4495e9d640409f8" alt="&#xBF;Qu&#xE9; es DVC (Data Version Control)  y c&#xF3;mo puede ayudar en tus proyectos de datos?"><span class="kg-bookmark-publisher">Data Version Control &#xB7; DVC</span></div></div><div class="kg-bookmark-thumbnail"><img src="https://dvc.org/social-share.png" alt="&#xBF;Qu&#xE9; es DVC (Data Version Control)  y c&#xF3;mo puede ayudar en tus proyectos de datos?"></div></a><figcaption><p dir="ltr"><span>Sitio web</span></p></figcaption></figure>
<h3 id="beneficios-de-usar-dvc"><strong>Beneficios de usar DVC</strong></h3>
<p>Hay muchos beneficios de usar DVC, incluidos:</p>
<ul><li><strong>Gesti&#xF3;n de datos centralizada:</strong> DVC te permite almacenar todos tus conjuntos de datos en un solo lugar. Esto facilita la b&#xFA;squeda de los datos que necesitas y la colaboraci&#xF3;n con otros.</li><li><strong>Seguimiento de cambios:</strong> DVC rastrea los cambios en tus conjuntos de datos. Esto facilita la comparaci&#xF3;n de versiones y la identificaci&#xF3;n de cambios.</li><li><strong>Compartici&#xF3;n de datos:</strong> DVC te permite compartir tus conjuntos de datos con otros de manera segura y eficiente.</li><li><strong>Automatizaci&#xF3;n:</strong> DVC se puede utilizar para automatizar tareas relacionadas con datos, como la generaci&#xF3;n de informes y la validaci&#xF3;n de datos.</li></ul>
<h3 id="c%C3%B3mo-comenzar-con-dvc"><strong>C&#xF3;mo comenzar con DVC</strong></h3>
<p>Para comenzar con DVC, primero deber&#xE1;s instalarlo. DVC est&#xE1; disponible para Windows, macOS y Linux. Una vez que hayas instalado DVC, puedes comenzar a almacenar tus conjuntos de datos. Para almacenar un conjunto de datos, usa el comando <code>dvc init</code>. Este comando crear&#xE1; un directorio para tu conjunto de datos y agregar&#xE1; un archivo de configuraci&#xF3;n <code>.dvc</code>. El archivo de configuraci&#xF3;n <code>.dvc</code> contiene informaci&#xF3;n sobre tu conjunto de datos, como su nombre, formato y tama&#xF1;o.</p>
<figure class="kg-card kg-bookmark-card kg-card-hascaption"><a class="kg-bookmark-container" href="https://github.com/iterative/dvc?ref=sredevops.org"><div class="kg-bookmark-content"><div class="kg-bookmark-title">GitHub - iterative/dvc: &#x1F989; Data Version Control | Git for Data &amp; Models | ML Experiments Management</div><div class="kg-bookmark-description">&#x1F989; Data Version Control | Git for Data &amp; Models | ML Experiments Management - GitHub - iterative/dvc: &#x1F989; Data Version Control | Git for Data &amp; Models | ML Experiments Management</div><div class="kg-bookmark-metadata"><img class="kg-bookmark-icon" src="https://github.com/fluidicon.png" alt="&#xBF;Qu&#xE9; es DVC (Data Version Control)  y c&#xF3;mo puede ayudar en tus proyectos de datos?"><span class="kg-bookmark-author">iterative</span><span class="kg-bookmark-publisher">GitHub</span></div></div><div class="kg-bookmark-thumbnail"><img src="https://repository-images.githubusercontent.com/83878269/a5c64400-8fdd-11ea-9851-ec57bc168db5" alt="&#xBF;Qu&#xE9; es DVC (Data Version Control)  y c&#xF3;mo puede ayudar en tus proyectos de datos?"></div></a><figcaption><p dir="ltr"><span>Repo en Github</span></p></figcaption></figure>
<p>Una vez que hayas almacenado tus conjuntos de datos, puedes comenzar a rastrearlos. Para rastrear un conjunto de datos, usa el comando <code>dvc add</code>. Este comando crear&#xE1; un registro de cambios para tu conjunto de datos. El registro de cambios contiene informaci&#xF3;n sobre los cambios que has realizado en tu conjunto de datos, como la fecha, la hora y el autor del cambio.</p>
<p>Puedes usar DVC para compartir tus conjuntos de datos con otros. Para compartir un conjunto de datos, usa el comando <code>dvc push</code>. Este comando cargar&#xE1; tu conjunto de datos en un repositorio DVC. Un repositorio DVC es un almac&#xE9;n para conjuntos de datos DVC. Puedes usar un repositorio DVC para almacenar tus conjuntos de datos de forma segura y eficiente.</p>
<figure class="kg-card kg-embed-card"><iframe width="200" height="113" src="https://www.youtube.com/embed/UbL7VUpv1Bs?feature=oembed" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" allowfullscreen title="Version Control for Data Science Explained in 5 Minutes (No Code!)"></iframe></figure>
<h3 id="conclusi%C3%B3n"><strong>Conclusi&#xF3;n</strong></h3>
<p>DVC es una herramienta poderosa que puede ayudarte a administrar y compartir tus datos de manera m&#xE1;s eficiente. Si est&#xE1;s trabajando con datos, DVC es una herramienta que debes considerar usar.</p>]]></content:encoded></item><item><title><![CDATA[Google anuncia la "supremacía cuántica": presenta Sycamore, el procesador de 70 qubits que deja en ridículo a los supercomputadores actuales]]></title><description><![CDATA[Qué significa la computación cuántica? Qué significa Phase transition? Qué es Random Circuit Sampling?]]></description><link>https://sredevops.org/google-anuncia-la-supremacia-cuantica-presenta-sycamore-el-procesador-de-70-qubits-que-deja-en-ridiculo-a-los-supercomputadores-actuales/</link><guid isPermaLink="false">64b27355cd13ae00011c2b64</guid><category><![CDATA[Quantum Computing]]></category><category><![CDATA[Qubits]]></category><category><![CDATA[Columnas]]></category><category><![CDATA[Noticias]]></category><category><![CDATA[Destacado]]></category><dc:creator><![CDATA[Nicolás Georger]]></dc:creator><pubDate>Sat, 15 Jul 2023 11:29:36 GMT</pubDate><media:content url="https://images.unsplash.com/photo-1534744971734-e1628d37ea01?crop=entropy&amp;cs=tinysrgb&amp;fit=max&amp;fm=jpg&amp;ixid=M3wxMTc3M3wwfDF8c2VhcmNofDF8fHF1YW50dW0lMjB8ZW58MHx8fHwxNjg5NDIwNDc2fDA&amp;ixlib=rb-4.0.3&amp;q=80&amp;w=2000" medium="image"/><content:encoded><![CDATA[<img src="https://images.unsplash.com/photo-1534744971734-e1628d37ea01?crop=entropy&amp;cs=tinysrgb&amp;fit=max&amp;fm=jpg&amp;ixid=M3wxMTc3M3wwfDF8c2VhcmNofDF8fHF1YW50dW0lMjB8ZW58MHx8fHwxNjg5NDIwNDc2fDA&amp;ixlib=rb-4.0.3&amp;q=80&amp;w=2000" alt="Google anuncia la &quot;supremac&#xED;a cu&#xE1;ntica&quot;: presenta Sycamore, el procesador de 70 qubits que deja en rid&#xED;culo a los supercomputadores actuales"><p>Google ha anunciado que ha alcanzado la &quot;supremac&#xED;a cu&#xE1;ntica&quot;, lo que significa que ha creado un sistema inform&#xE1;tico basado en qubits, que puede realizar una tarea pr&#xE1;cticamente imposible de resolver para cualquier computador cl&#xE1;sico.</p>
<p>El  &quot;hardware cu&#xE1;ntico&quot; previo de Google, llamado Sycamore, estaba compuesto por 53 <em>qubits</em>, <em>bits cu&#xE1;nticos</em> que pueden estar en dos estados al mismo tiempo (Un bit normal puede tener s&#xF3;lo 1). Sycamore se utiliz&#xF3; para resolver un problema de muestreo de circuitos aleatorios, un problema exponencialmente dif&#xED;cil de resolver (M&#xE1;s abajo explicamos en detalle).</p>
<div class="kg-card kg-callout-card kg-callout-card-blue"><div class="kg-callout-emoji">&#x1F4A1;</div><div class="kg-callout-text"><i><em class="italic">We conclude by presenting an RCS experiment with 70 qubits at 24 cycles. We estimate the computational cost against improved classical methods and demonstrate that </em></i><i><b><strong class="italic">our experiment is beyond the capabilities of existing classical supercomputers.</strong></b></i></div></div>
<figure class="kg-card kg-bookmark-card kg-card-hascaption"><a class="kg-bookmark-container" href="https://arxiv.org/abs/2304.11119?ref=sredevops.org"><div class="kg-bookmark-content"><div class="kg-bookmark-title">Phase transition in Random Circuit Sampling</div><div class="kg-bookmark-description">Quantum computers hold the promise of executing tasks beyond the capability
of classical computers. Noise competes with coherent evolution and destroys
long-range correlations, making it an outstanding challenge to fully leverage
the computation power of near-term quantum processors. We report Rando&#x2026;</div><div class="kg-bookmark-metadata"><img class="kg-bookmark-icon" src="https://static.arxiv.org/static/browse/0.3.4/images/icons/apple-touch-icon.png" alt="Google anuncia la &quot;supremac&#xED;a cu&#xE1;ntica&quot;: presenta Sycamore, el procesador de 70 qubits que deja en rid&#xED;culo a los supercomputadores actuales"><span class="kg-bookmark-author">A. Morvan</span><span class="kg-bookmark-publisher">arXiv.org</span></div></div><div class="kg-bookmark-thumbnail"><img src="https://static.arxiv.org/static/browse/0.3.4/images/arxiv-logo-fb.png" alt="Google anuncia la &quot;supremac&#xED;a cu&#xE1;ntica&quot;: presenta Sycamore, el procesador de 70 qubits que deja en rid&#xED;culo a los supercomputadores actuales"></div></a><figcaption><p dir="ltr"><span>Aqu&#xED; puedes leer el pre-print del paper </span></p></figcaption></figure>
<p><strong>&#xBF;Qu&#xE9; significa la supremac&#xED;a cu&#xE1;ntica para nosotros?</strong></p>
<p>La supremac&#xED;a cu&#xE1;ntica podr&#xED;a tener un impacto significativo en una amplia gama de industrias, incluyendo:</p>
<ul><li><strong>Criptograf&#xED;a:</strong> Los sistemas cu&#xE1;nticos podr&#xED;an usarse para romper los sistemas de seguridad actuales, lo que podr&#xED;a tener un impacto significativo en la industria financiera.</li><li><strong>Salud:</strong> Los sistemas cu&#xE1;nticos podr&#xED;an usarse para desarrollar nuevos tratamientos para enfermedades, como el c&#xE1;ncer.</li><li><strong>Materiales:</strong> Los sistemas cu&#xE1;nticos podr&#xED;an usarse para desarrollar nuevos materiales con propiedades mejoradas, como materiales m&#xE1;s ligeros y m&#xE1;s fuertes.</li><li><strong>Transporte:</strong> Los sistemas cu&#xE1;nticos podr&#xED;an usarse para desarrollar nuevos sistemas de transporte, como coches aut&#xF3;nomos y aviones m&#xE1;s eficientes.</li></ul>
<p>El logro de Google es un paso importante hacia el desarrollo de la computaci&#xF3;n cu&#xE1;ntica, y es probable que tenga un impacto significativo en nuestra vida diaria en los pr&#xF3;ximos a&#xF1;os.</p>
<p><strong>&#xBF;Cu&#xE1;les son los pr&#xF3;ximos pasos?</strong></p>
<p>El logro de Google es un hito importante, pero no es el final del camino. Los investigadores a&#xFA;n necesitan desarrollar sistemas cu&#xE1;nticos m&#xE1;s grandes y m&#xE1;s poderosos. Tambi&#xE9;n necesitan desarrollar nuevos algoritmos cu&#xE1;nticos que sean m&#xE1;s eficientes que los algoritmos cl&#xE1;sicos.</p>
<p>El desarrollo de la computaci&#xF3;n cu&#xE1;ntica es un proceso lento y gradual, pero tiene el potencial de revolucionar nuestra forma de vida.</p>
<figure class="kg-card kg-bookmark-card kg-card-hascaption"><a class="kg-bookmark-container" href="https://ai.googleblog.com/2019/10/quantum-supremacy-using-programmable.html?ref=sredevops.org"><div class="kg-bookmark-content"><div class="kg-bookmark-title">Quantum Supremacy Using a Programmable Superconducting Processor</div><div class="kg-bookmark-description"></div><div class="kg-bookmark-metadata"><img class="kg-bookmark-icon" src="https://ai.googleblog.com/favicon.ico" alt="Google anuncia la &quot;supremac&#xED;a cu&#xE1;ntica&quot;: presenta Sycamore, el procesador de 70 qubits que deja en rid&#xED;culo a los supercomputadores actuales"><span class="kg-bookmark-publisher">Google Research</span></div></div><div class="kg-bookmark-thumbnail"><img src="https://1.bp.blogspot.com/-BkfEqVH_52c/Xa9u3IgAocI/AAAAAAAAE00/0eUDUl5YhJ4pDTKO3QNOkCJHpxbbnZ-EQCLcBGAsYHQ/w1200-h630-p-k-no-nu/image7.png" alt="Google anuncia la &quot;supremac&#xED;a cu&#xE1;ntica&quot;: presenta Sycamore, el procesador de 70 qubits que deja en rid&#xED;culo a los supercomputadores actuales"></div></a><figcaption><p dir="ltr"><span>Publicaci&#xF3;n de Google respecto al hito anterior</span></p></figcaption></figure>
<h2 id="qu%C3%A9-significa-la-computaci%C3%B3n-cu%C3%A1ntica-qu%C3%A9-significa-phase-transition-qu%C3%A9-es-random-circuit-sampling">Qu&#xE9; significa la computaci&#xF3;n cu&#xE1;ntica? Qu&#xE9; significa Phase transition? Qu&#xE9; es Random Circuit Sampling?</h2>
<h3 id="muestreo-de-circuitos-aleatorios-y-transici%C3%B3n-de-fase"><strong>Muestreo de circuitos aleatorios y transici&#xF3;n de fase</strong></h3>
<p>El muestreo de circuitos aleatorios (Random Circuit Sampling, RCS) es un problema de computaci&#xF3;n cu&#xE1;ntica que implica encontrar el estado de un sistema cu&#xE1;ntico despu&#xE9;s de que se le haya aplicado un circuito aleatorio. Este problema es dif&#xED;cil de resolver para sistemas grandes, pero tiene aplicaciones en &#xE1;reas como la criptograf&#xED;a y la inteligencia artificial.</p>
<p>Una transici&#xF3;n de fase <em>(Phase transition)</em> es un punto en el que las propiedades de un sistema cambian dram&#xE1;ticamente. En el caso del RCS, la transici&#xF3;n de fase ocurre cuando el tama&#xF1;o del circuito aumenta m&#xE1;s all&#xE1; de cierto punto. Por debajo de la transici&#xF3;n de fase, el estado del sistema es f&#xE1;cil de muestrear, pero por encima de la transici&#xF3;n de fase, el estado del sistema se vuelve mucho m&#xE1;s dif&#xED;cil de muestrear.</p>
<p>La transici&#xF3;n de fase en el RCS ha sido estudiada por muchos investigadores, pero a&#xFA;n no se comprende completamente. Sin embargo, se ha demostrado que la transici&#xF3;n de fase es un fen&#xF3;meno universal que ocurre en una amplia variedad de sistemas cu&#xE1;nticos.</p>
<p>La transici&#xF3;n de fase en el RCS tiene implicaciones importantes para el dise&#xF1;o de algoritmos cu&#xE1;nticos. Por ejemplo, los algoritmos que se basan en el RCS pueden ser mucho m&#xE1;s eficientes debajo de la transici&#xF3;n de fase que por encima de la transici&#xF3;n de fase.</p>
<p>La investigaci&#xF3;n de la transici&#xF3;n de fase en el RCS es un &#xE1;rea activa de investigaci&#xF3;n en la computaci&#xF3;n cu&#xE1;ntica. Con un mayor entendimiento de la transici&#xF3;n de fase, es posible desarrollar nuevos algoritmos cu&#xE1;nticos que sean m&#xE1;s eficientes y m&#xE1;s poderosos que los algoritmos cl&#xE1;sicos.</p>
<h3 id="aplicaciones">Aplicaciones</h3>
<p>El RCS tiene una serie de aplicaciones potenciales, que incluyen:</p>
<ul><li><strong>C&#xE1;lculo cu&#xE1;ntico:</strong> el RCS se puede utilizar para calcular la funci&#xF3;n de partici&#xF3;n de un sistema cu&#xE1;ntico, lo que puede ser &#xFA;til para resolver problemas en qu&#xED;mica, f&#xED;sica y materiales.</li><li><strong>Criptograf&#xED;a:</strong> el RCS se puede utilizar para romper sistemas de criptograf&#xED;a cu&#xE1;ntica, como el protocolo de Shor.</li><li><strong>Inteligencia artificial:</strong> el RCS se puede utilizar para entrenar modelos de aprendizaje autom&#xE1;tico, como redes neurales.</li></ul>
<h3 id></h3>
<p></p>]]></content:encoded></item><item><title><![CDATA[Pipedream, uno de los mejores servicios para automatizaciones, anuncia soporte para Node v18]]></title><description><![CDATA[<p>Pipedream ahora utiliza Node v18 como su entorno de ejecuci&#xF3;n predeterminado.  Esta actualizaci&#xF3;n brinda a los desarrolladores una serie de mejoras y caracter&#xED;sticas nuevas para potenciar sus flujos de trabajo. Veamos m&#xE1;s detalles al respecto.</p>
<h2 id="node-v18-potencia-y-estabilidad-para-los-flujos-de-trabajo-en-pipedream">Node v18: Potencia y estabilidad para los</h2>]]></description><link>https://sredevops.org/pipedream-uno-de-los-mejores-servicios-para-automatizaciones-anuncia-soporte-para-node-v18/</link><guid isPermaLink="false">64ade04e8c69ce0001277155</guid><category><![CDATA[Automatización]]></category><category><![CDATA[PaaS]]></category><dc:creator><![CDATA[Nicolás Georger]]></dc:creator><pubDate>Wed, 12 Jul 2023 07:09:07 GMT</pubDate><media:content url="https://sredevops.org/content/images/2023/07/unnamed--1-.png" medium="image"/><content:encoded><![CDATA[<img src="https://sredevops.org/content/images/2023/07/unnamed--1-.png" alt="Pipedream, uno de los mejores servicios para automatizaciones, anuncia soporte para Node v18"><p>Pipedream ahora utiliza Node v18 como su entorno de ejecuci&#xF3;n predeterminado.  Esta actualizaci&#xF3;n brinda a los desarrolladores una serie de mejoras y caracter&#xED;sticas nuevas para potenciar sus flujos de trabajo. Veamos m&#xE1;s detalles al respecto.</p>
<h2 id="node-v18-potencia-y-estabilidad-para-los-flujos-de-trabajo-en-pipedream">Node v18: Potencia y estabilidad para los flujos de trabajo en Pipedream</h2>
<p>Desde la implementaci&#xF3;n de flujos de trabajo existentes hasta la creaci&#xF3;n de nuevos, Pipedream garantiza que todas estas tareas ahora se realicen en un entorno de ejecuci&#xF3;n basado en Node 18. Esta actualizaci&#xF3;n es sin&#xF3;nimo de estabilidad y eficiencia, ya que los principales paquetes de npm han sido compatibles con Node 18 durante un tiempo considerable. Por lo tanto, se espera que los usuarios experimenten una transici&#xF3;n fluida sin enfrentar problemas o cambios significativos al actualizar a esta nueva versi&#xF3;n.</p>
<p>Una de las mejoras m&#xE1;s destacadas es la compatibilidad de paquetes que previamente no funcionaban correctamente en el entorno de ejecuci&#xF3;n v14, como discord.js. Con Node 18, estos paquetes ahora deber&#xED;an funcionar sin contratiempos, lo que ampl&#xED;a enormemente las posibilidades de desarrollo. Adem&#xE1;s, Node 18 introduce una nueva API de b&#xFA;squeda nativa que brinda a los desarrolladores a&#xFA;n m&#xE1;s herramientas y opciones para sus flujos de trabajo. Para obtener m&#xE1;s detalles sobre las caracter&#xED;sticas y mejoras espec&#xED;ficas, se recomienda consultar los registros de cambios de Node 16 y Node 18.</p>
<p>Node.js sigue siendo el entorno de ejecuci&#xF3;n m&#xE1;s popular en Pipedream, y los desarrolladores pueden aprovecharlo al m&#xE1;ximo. La plataforma permite escribir c&#xF3;digo en Node.js y utilizar cualquier paquete de npm necesario para personalizar los flujos de trabajo. Asimismo, se brinda la posibilidad de controlar completamente los flujos de trabajo, permitiendo finalizarlos, retrasarlos o reintentarlos de forma program&#xE1;tica seg&#xFA;n las necesidades espec&#xED;ficas de cada proyecto. Para obtener informaci&#xF3;n adicional sobre c&#xF3;mo aprovechar al m&#xE1;ximo Node.js en Pipedream, los usuarios pueden consultar la documentaci&#xF3;n correspondiente.</p>
<h2 id="diversidad-de-opciones-python-bash-y-go">Diversidad de opciones: Python, Bash y Go</h2>
<p>Adem&#xE1;s de su enfoque en Node.js, Pipedream tambi&#xE9;n valora la diversidad y ofrece soporte para otros lenguajes de programaci&#xF3;n populares, como Python, Bash y Go. Lo m&#xE1;s interesante es que estos lenguajes pueden ser utilizados en conjunto dentro del mismo flujo de trabajo. Esta flexibilidad brinda a los desarrolladores la capacidad de combinar las fortalezas de diferentes lenguajes en una sola aplicaci&#xF3;n. Por ejemplo, se pueden aprovechar las capacidades de transformaci&#xF3;n de datos de Node.js junto con las poderosas capacidades de an&#xE1;lisis de la biblioteca pandas de Python, o utilizar Bash o Go para tareas espec&#xED;ficas seg&#xFA;n sea necesario. Las posibilidades son infinitas y dependen de la creatividad y las necesidades del proyecto.</p>
<h2 id="la-opini%C3%B3n-de-los-usuarios-es-importante">La opini&#xF3;n de los usuarios es importante</h2>
<p>Pipedream est&#xE1; comprometido con el c&#xF3;digo abierto <a href="https://github.com/PipedreamHQ/pipedream/pull/7031?ref=sredevops.org"><em>-incluso quien escribe tiene un peque&#xF1;o pull request aprobado-</em></a> y se alienta a los desarrolladores a brindar comentarios, hacer sugerencias o plantear preguntas sobre las actualizaciones recientes o cualquier otro aspecto relacionado con Pipedream. El equipo de la plataforma est&#xE1; comprometido en brindar un soporte de calidad y se encuentra disponible para ayudar en todo lo necesario. Adem&#xE1;s, se invita a los usuarios a unirse a la comunidad de Pipedream, donde podr&#xE1;n interactuar con otros desarrolladores, compartir conocimientos y obtener respuestas a sus inquietudes.</p>
<p>En resumen, la incorporaci&#xF3;n de Node v18 como entorno de ejecuci&#xF3;n predeterminado en Pipedream supone una mejora significativa para los flujos de trabajo, ofreciendo mayor potencia, estabilidad y opciones de desarrollo. Ya sea que los desarrolladores prefieran trabajar con Node.js, Python, Bash o Go, Pipedream proporciona las herramientas necesarias para llevar los proyectos al siguiente nivel.</p>
<p>Github:</p>
<figure class="kg-card kg-bookmark-card"><a class="kg-bookmark-container" href="https://github.com/PipedreamHQ/pipedream?ref=sredevops.org"><div class="kg-bookmark-content"><div class="kg-bookmark-title">GitHub - PipedreamHQ/pipedream: Connect APIs, remarkably fast. Free for developers.</div><div class="kg-bookmark-description">Connect APIs, remarkably fast. Free for developers. - GitHub - PipedreamHQ/pipedream: Connect APIs, remarkably fast. Free for developers.</div><div class="kg-bookmark-metadata"><img class="kg-bookmark-icon" src="https://github.com/fluidicon.png" alt="Pipedream, uno de los mejores servicios para automatizaciones, anuncia soporte para Node v18"><span class="kg-bookmark-publisher">GitHub</span><span class="kg-bookmark-author">PipedreamHQ</span></div></div><div class="kg-bookmark-thumbnail"><img src="https://opengraph.githubassets.com/a9e5c3c7702d6f99c4b5944095430ba413e81fcbd79f239063a7e873f37edd5d/PipedreamHQ/pipedream" alt="Pipedream, uno de los mejores servicios para automatizaciones, anuncia soporte para Node v18"></div></a></figure>]]></content:encoded></item><item><title><![CDATA[No más bastiones en AWS: Con EC2 Instance Connect llegas a tu instancia sin IP pública]]></title><description><![CDATA[Desde hoy puedes conectarte a un servidor EC2 en Amazon Web Services (AWS) utilizando "EC2 Instance Connect", sin necesidad de una IP pública ni un host bastión . Este artículo te ayudará a entender cómo configurar correctamente tu endpoint y obtener una conexión segura a tu servidor EC2 en AWS.]]></description><link>https://sredevops.org/no-mas-bastiones-en-aws-con-ec2-instance-connect-conectar-a-tu-instancia-sin-ip-publica/</link><guid isPermaLink="false">64ac1551f462f500018bb238</guid><category><![CDATA[DevOps]]></category><category><![CDATA[AWS]]></category><dc:creator><![CDATA[Nicolás Georger]]></dc:creator><pubDate>Mon, 10 Jul 2023 15:46:17 GMT</pubDate><media:content url="https://sredevops.org/content/images/2023/07/ec2-instance-connect-endpoint.svg" medium="image"/><content:encoded><![CDATA[<div class="kg-card kg-signup-card kg-width-full kg-content-wide " data-lexical-signup-form style="background-color: #2a002e; display: none;">
            
            <div class="kg-signup-card-content">
                
                <div class="kg-signup-card-text kg-align-center">
                    <h2 class="kg-signup-card-heading" style="color: #FFFFFF;"><span>Registrate en SREDevOps</span></h2>
                    <h3 class="kg-signup-card-subheading" style="color: #FFFFFF;"><span>Somos Comunidad DevOps, Site Reliability Engineering y Platform Engineering en Sudam&#xE9;rica.</span></h3>
                    
        <form class="kg-signup-card-form" data-members-form="signup">
            <input data-members-label type="hidden" value="Formularios">
            <div class="kg-signup-card-fields">
                <input class="kg-signup-card-input" id="email" data-members-email type="email" required="true" placeholder="Your email">
                <button class="kg-signup-card-button kg-style-accent" style="color: #FFFFFF;" type="submit">
                    <span class="kg-signup-card-button-default">Suscribeme!</span>
                    <span class="kg-signup-card-button-loading"><svg xmlns="http://www.w3.org/2000/svg" height="24" width="24" viewbox="0 0 24 24">
        <g stroke-linecap="round" stroke-width="2" fill="currentColor" stroke="none" stroke-linejoin="round" class="nc-icon-wrapper">
            <g class="nc-loop-dots-4-24-icon-o">
                <circle cx="4" cy="12" r="3"/>
                <circle cx="12" cy="12" r="3"/>
                <circle cx="20" cy="12" r="3"/>
            </g>
            <style data-cap="butt">
                .nc-loop-dots-4-24-icon-o{--animation-duration:0.8s}
                .nc-loop-dots-4-24-icon-o *{opacity:.4;transform:scale(.75);animation:nc-loop-dots-4-anim var(--animation-duration) infinite}
                .nc-loop-dots-4-24-icon-o :nth-child(1){transform-origin:4px 12px;animation-delay:-.3s;animation-delay:calc(var(--animation-duration)/-2.666)}
                .nc-loop-dots-4-24-icon-o :nth-child(2){transform-origin:12px 12px;animation-delay:-.15s;animation-delay:calc(var(--animation-duration)/-5.333)}
                .nc-loop-dots-4-24-icon-o :nth-child(3){transform-origin:20px 12px}
                @keyframes nc-loop-dots-4-anim{0%,100%{opacity:.4;transform:scale(.75)}50%{opacity:1;transform:scale(1)}}
            </style>
        </g>
    </svg></span>
                </button>
            </div>
            <div class="kg-signup-card-success" style="color: #FFFFFF;">
                Email sent! Check your inbox to complete your signup.
            </div>
            <div class="kg-signup-card-error" style="color: #FFFFFF;" data-members-error></div>
        </form>
        
                    <img src="https://sredevops.org/content/images/2023/07/ec2-instance-connect-endpoint.svg" alt="No m&#xE1;s bastiones en AWS: Con EC2 Instance Connect llegas a tu instancia sin IP p&#xFA;blica"><p class="kg-signup-card-disclaimer" style="color: #FFFFFF;"><span>Sin SPAM, f&#xE1;cil de desinscribir, gratuito.</span></p>
                </div>
            </div>
        </div>
<p>Desde hoy puedes conectarte a un servidor EC2 en Amazon Web Services (AWS) utilizando &quot;EC2 Instance Connect&quot;, sin necesidad de una IP p&#xFA;blica ni un host basti&#xF3;n . Este art&#xED;culo te ayudar&#xE1; a entender c&#xF3;mo configurar correctamente tu endpoint y obtener una conexi&#xF3;n segura a tu servidor EC2 en AWS.</p>
<p>Para comenzar, debes tener una cuenta AWS activada y creada para poder utilizar los recursos de su nube. Despu&#xE9;s, debes crear una instancia en el servicio EC2 de AWS. Una vez que tienes tu instancia creada, es hora de configurar tu instance endpoint, asi podr&#xE1;s dejar de utilizar una IP p&#xFA;blica y/o no usar un basti&#xF3;n.</p>
<figure class="kg-card kg-bookmark-card"><a class="kg-bookmark-container" href="https://docs.aws.amazon.com/es_es/AWSEC2/latest/UserGuide/Connect-using-EC2-Instance-Connect-Endpoint.html?ref=sredevops.org"><div class="kg-bookmark-content"><div class="kg-bookmark-title">Con&#xE9;ctese a las instancias sin necesidad de una direcci&#xF3;n IPv4 p&#xFA;blica mediante el punto de conexi&#xF3;n de EC2 Instance Connect - Amazon Elastic Compute Cloud</div><div class="kg-bookmark-description">Uso del punto de conexi&#xF3;n de EC2 Instance Connect para conectarse a las instancias sin necesidad de una direcci&#xF3;n IPv4 p&#xFA;blica.</div><div class="kg-bookmark-metadata"><img class="kg-bookmark-icon" src="https://docs.aws.amazon.com/assets/images/favicon.ico" alt="No m&#xE1;s bastiones en AWS: Con EC2 Instance Connect llegas a tu instancia sin IP p&#xFA;blica"><span class="kg-bookmark-publisher">Amazon Elastic Compute Cloud</span></div></div><div class="kg-bookmark-thumbnail"><img src="https://docs.aws.amazon.com/es_es/AWSEC2/latest/UserGuide/images/ec2-instance-connect-endpoint.svg" alt="No m&#xE1;s bastiones en AWS: Con EC2 Instance Connect llegas a tu instancia sin IP p&#xFA;blica"></div></a></figure>
<p>El instance endpoint es un identificador que se utiliza para conectar un cliente fuera de la red VPC a una instancia en AWS. Este endpoint consiste en una direcci&#xF3;n IP y un puerto espec&#xED;fico asignados por AWS al servidor EC2. Para obtener tu endpoint de instancia, debes ir a la p&#xE1;gina de configuraci&#xF3;n del servicio EC2 en AWS y buscar el apartado &quot;Endpoints&quot;. All&#xED; encontrar&#xE1;s una lista de endpoints para cada instancia creada en tu cuenta de AWS.</p>
<figure class="kg-card kg-bookmark-card"><a class="kg-bookmark-container" href="https://docs.aws.amazon.com/es_es/AWSEC2/latest/UserGuide/create-ec2-instance-connect-endpoints.html?ref=sredevops.org"><div class="kg-bookmark-content"><div class="kg-bookmark-title">Creaci&#xF3;n de un punto de conexi&#xF3;n de EC2 Instance Connect - Amazon Elastic Compute Cloud</div><div class="kg-bookmark-description">Puede crear un punto de conexi&#xF3;n de EC2 Instance Connect en una subred de la VPC. A continuaci&#xF3;n, puede usar el punto de conexi&#xF3;n de EC2 Instance Connect para conectarse a instancias en la VPC sin necesidad de que la instancia tenga una direcci&#xF3;n IPv4 p&#xFA;blica.</div><div class="kg-bookmark-metadata"><img class="kg-bookmark-icon" src="https://docs.aws.amazon.com/assets/images/favicon.ico" alt="No m&#xE1;s bastiones en AWS: Con EC2 Instance Connect llegas a tu instancia sin IP p&#xFA;blica"><span class="kg-bookmark-publisher">Amazon Elastic Compute Cloud</span></div></div><div class="kg-bookmark-thumbnail"><img src="https://docs.aws.amazon.com/es_es/AWSEC2/latest/UserGuide/images/ec2-instance-connect-endpoint-create.png" alt="No m&#xE1;s bastiones en AWS: Con EC2 Instance Connect llegas a tu instancia sin IP p&#xFA;blica"></div></a></figure>
<p>Una vez que tienes tu endpoint, es hora de configurarlo en tu c&#xF3;digo o aplicaci&#xF3;n. Para hacer esto, debes utilizar un cliente o biblioteca (librer&#xED;a/library) con soporte de protocolos TCP, UDP, o HTTP. Despu&#xE9;s, debes especificar el nombre del servicio y la direcci&#xF3;n IP asignada por AWS al endpoint provisto por AWS.</p>
<p>Una vez que tienes tu endpoint configurado correctamente en tu c&#xF3;digo, podr&#xE1;s conectarte a tu servidor EC2 en AWS de manera segura. </p>
<p></p>]]></content:encoded></item><item><title><![CDATA[Qué es Platform Engineering? Para qué me sirve? Qué pasó con DevOps?]]></title><description><![CDATA[<p>&#xBF;Has estado escuchando y leyendo sobre Platform Engineering (ingenier&#xED;a de plataformas) en toda la web &#xFA;ltimamente... pero <strong>&#xBF;realmente entendemos qu&#xE9; es Platform Engineering?</strong> Todo el mundo parece estar convencido y entusiasmado, pero <strong>&#xBF;puedes ver en qu&#xE9; se diferencia de DevOps?</strong> Intentaremos dar</p>]]></description><link>https://sredevops.org/que-es-platform-engineering-para-que-me-sirve-que-paso-con-devops/</link><guid isPermaLink="false">649ee9bf01f0270001e70fe3</guid><category><![CDATA[Platform Engineering]]></category><category><![CDATA[Destacado]]></category><category><![CDATA[Columnas]]></category><category><![CDATA[SRE]]></category><category><![CDATA[DevOps]]></category><dc:creator><![CDATA[Nicolás Georger]]></dc:creator><pubDate>Fri, 30 Jun 2023 16:44:19 GMT</pubDate><media:content url="https://images.unsplash.com/photo-1523961131990-5ea7c61b2107?crop=entropy&amp;cs=tinysrgb&amp;fit=max&amp;fm=jpg&amp;ixid=M3wxMTc3M3wwfDF8c2VhcmNofDN8fGludGVncmF0aW9ufGVufDB8fHx8MTY4ODA5NDYzMXww&amp;ixlib=rb-4.0.3&amp;q=80&amp;w=2000" medium="image"/><content:encoded><![CDATA[<img src="https://images.unsplash.com/photo-1523961131990-5ea7c61b2107?crop=entropy&amp;cs=tinysrgb&amp;fit=max&amp;fm=jpg&amp;ixid=M3wxMTc3M3wwfDF8c2VhcmNofDN8fGludGVncmF0aW9ufGVufDB8fHx8MTY4ODA5NDYzMXww&amp;ixlib=rb-4.0.3&amp;q=80&amp;w=2000" alt="Qu&#xE9; es Platform Engineering? Para qu&#xE9; me sirve? Qu&#xE9; pas&#xF3; con DevOps?"><p>&#xBF;Has estado escuchando y leyendo sobre Platform Engineering (ingenier&#xED;a de plataformas) en toda la web &#xFA;ltimamente... pero <strong>&#xBF;realmente entendemos qu&#xE9; es Platform Engineering?</strong> Todo el mundo parece estar convencido y entusiasmado, pero <strong>&#xBF;puedes ver en qu&#xE9; se diferencia de DevOps?</strong> Intentaremos dar un resumen general apoy&#xE1;ndonos en el material que la Comunidad Platform Engineering est&#xE1; compartiendo.</p><p>Luca, de la <a href="https://community.platformengineering.org/?ref=sredevops.org">Comunidad Platform Engineering</a>, nos resume en este video algunas ideas. En este video, vamos a aclarar todo sobre la disciplina emergente de Platform Engineering. Te daremos una definici&#xF3;n precisa, explicaremos c&#xF3;mo encaja en el ecosistema cloud native y cu&#xE1;les son sus principales diferencias con DevOps.<br>Tambi&#xE9;n hablaremos del valor de Platform Engineering tanto para SREs/DevOps como para desarrolladores y c&#xF3;mo se conecta con una plataforma interna para desarrolladores.<br>Por &#xFA;ltimo, abordaremos los principales retos a los que se enfrentan los ingenieros de plataformas y ofreceremos algunos consejos y buenas pr&#xE1;cticas.</p><p>As&#xED; que, si est&#xE1;s listo para aprender m&#xE1;s sobre esta nueva frontera de las operaciones en la nube, empecemos.</p><figure class="kg-card kg-embed-card"><iframe width="200" height="113" src="https://www.youtube.com/embed/Bfhl8kcSaEI?feature=oembed" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" allowfullscreen title="What is Platform Engineering?"></iframe></figure><h3 id="%C2%BFqu%C3%A9-es-platform-engineering"><strong>&#xBF;Qu&#xE9; es Platform Engineering?</strong></h3><p>Platform Engineering es el arte de combinar todas las diferentes tecnolog&#xED;as y herramientas que componen tu &quot;golden path&quot; o &quot;ruta ideal&quot;. Estos caminos permiten a los desarrolladores el autoservicio y reducen la carga de las personas en una organizaci&#xF3;n. La suma de estos caminos se conoce como plataforma interna de desarrollo o IDP (Internal Developer Platform), por sus siglas en ingl&#xE9;s.</p><p>La IDP es construida por un equipo de Platform Engineering, siguiendo un enfoque de &quot;plataforma como producto&quot;. Esto significa que el equipo de la plataforma debe tratar a los desarrolladores como sus propios clientes internos.</p><h3 id="documentaci%C3%B3n-idp">Documentaci&#xF3;n IDP</h3><figure class="kg-card kg-bookmark-card"><a class="kg-bookmark-container" href="https://internaldeveloperplatform.org/?ref=sredevops.org"><div class="kg-bookmark-content"><div class="kg-bookmark-title">Internal Developer Platform</div><div class="kg-bookmark-description">Internal Developer Platform # Everything the WWW has around Internal Developer Platforms in one curated space. It helps you understand the why, how, what and who.A modern way to run engineering teams # While self-built IDPs have been around in elite teams for around 5 years, they&#x2019;re now going mains&#x2026;</div><div class="kg-bookmark-metadata"><img class="kg-bookmark-icon" src="https://internaldeveloperplatform.org/favicon.png" alt="Qu&#xE9; es Platform Engineering? Para qu&#xE9; me sirve? Qu&#xE9; pas&#xF3; con DevOps?"><span class="kg-bookmark-author">Internal Developer Platform</span></div></div><div class="kg-bookmark-thumbnail"><img src="https://internaldeveloperplatform.org/full_logo.png" alt="Qu&#xE9; es Platform Engineering? Para qu&#xE9; me sirve? Qu&#xE9; pas&#xF3; con DevOps?"></div></a></figure><h3 id="%C2%BFpor-qu%C3%A9-tanto-revuelo"><strong>&#xBF;Por qu&#xE9; tanto revuelo?</strong></h3><p>La ingenier&#xED;a de plataforma es la respuesta de las organizaciones de ingenier&#xED;a de alto rendimiento para evitar las trampas de la realidad actual de DevOps. Aunque el concepto de &quot;You-Build-It-You-Run-It&quot; es genial en teor&#xED;a, la pr&#xE1;ctica diaria de DevOps est&#xE1; fallando. Los desarrolladores se ven abrumados por las tecnolog&#xED;as nativas de la nube y necesitan depender de operaciones para hacer cualquier cosa m&#xE1;s all&#xE1; de una simple actualizaci&#xF3;n de una imagen.</p><p>Es por eso que empresas como Airbnb y Spotify, que necesitaban a&#xF1;adir cientos de desarrolladores cada mes, se dieron cuenta r&#xE1;pidamente de que la &#xFA;nica forma de permitir a los desarrolladores el autoservicio y el verdadero &quot;t&#xFA; lo construyes, t&#xFA; lo manejas&quot; era construyendo una capa de plataforma entre los desarrolladores y las operaciones.</p><h3 id="beneficios"><strong>Beneficios</strong></h3><p>Esa capa es lo que llamamos Plataforma Interna de Desarrolladores (IDP), y es el producto final de Platform Engineering. Veamos qu&#xE9; ventajas ofrece:</p><ul><li>Para el equipo de operaciones: Ya no est&#xE1;n abrumados con tickets de operaciones y tendr&#xE1;n m&#xE1;s tiempo libre para trabajar en iniciativas estrat&#xE9;gicas en lugar de reaccionar constantemente a los problemas y solicitudes de los desarrolladores. Adem&#xE1;s, su configuraci&#xF3;n de entrega ser&#xE1; conforme, segura y con servicios e infraestructura altamente estandarizados, lo que facilitar&#xE1; el mantenimiento y reducir&#xE1; la tasa de fallos en los cambios.</li><li>Para los desarrolladores: Ahora podr&#xE1;n enviar cambios m&#xE1;s r&#xE1;pidamente mediante el autoservicio de sus dependencias de carga de trabajo, sin depender de operaciones. Podr&#xE1;n crear f&#xE1;cilmente entornos de PR, nuevos servicios y recursos sin tener que lidiar con herramientas complejas como Terraform o Helm. Adem&#xE1;s, ya no tendr&#xE1;n que escribir y mantener configuraciones, permitiendo a los desarrolladores senior enfocarse en lo que llamamos &quot;operaciones en la sombra&quot;.</li></ul><h3 id="desaf%C3%ADos"><strong>Desaf&#xED;os</strong></h3><p>Aunque Platform Engineering tiene grandes ventajas, a&#xFA;n est&#xE1; en una etapa temprana y presenta desaf&#xED;os que deben abordarse. El principal desaf&#xED;o es la comunicaci&#xF3;n. Muchos equipos de plataformas fracasan porque no colaboran lo suficiente con los desarrolladores para permitirles iterar r&#xE1;pidamente sobre las caracter&#xED;sticas de la plataforma interna de desarrollo. Adem&#xE1;s, a menudo no comunican claramente el retorno de inversi&#xF3;n (ROI) de la iniciativa de la plataforma a los ejecutivos.</p><p>Es por eso que es importante conocer a otros ingenieros de plataformas y compartir las mejores pr&#xE1;cticas. El sitio <a href="https://community.platformengineering.org/?ref=sredevops.org">Platform Engineering</a> ha superado recientemente los 10.000 miembros y la comunidad sigue creciendo, lo que demuestra que estamos tocando un tema importante en la industria de DevOps.</p><figure class="kg-card kg-bookmark-card"><a class="kg-bookmark-container" href="https://community.platformengineering.org/?ref=sredevops.org"><div class="kg-bookmark-content"><div class="kg-bookmark-title">platformengin-b0m7058 #chaos</div><div class="kg-bookmark-description">Platform engineering is the discipline of designing and building toolchains and workflows that enable self-service capabilities for software engineering organizations in the cloud-native era. platformengin-b0m7058 #chaos Latest</div><div class="kg-bookmark-metadata"><img class="kg-bookmark-icon" src="https://www.linen.dev/favicon.ico" alt="Qu&#xE9; es Platform Engineering? Para qu&#xE9; me sirve? Qu&#xE9; pas&#xF3; con DevOps?"><span class="kg-bookmark-author">platformengin-b0m7058 #chaos</span></div></div><div class="kg-bookmark-thumbnail"><img src="https://static.main.linendev.com/platform-engineering-logo.svg" alt="Qu&#xE9; es Platform Engineering? Para qu&#xE9; me sirve? Qu&#xE9; pas&#xF3; con DevOps?"></div></a></figure>]]></content:encoded></item><item><title><![CDATA[Kernel Linux 6.4 ya disponible, incluye soporte para Macs Silicon M2]]></title><description><![CDATA[<p>Llega unos meses despu&#xE9;s del lanzamiento de Linux Kernel 6.3, acorde a lo planificado.</p><p>Esta versi&#xF3;n ofrece muchas mejoras, como la compatibilidad inicial con Apple Silicon M2 (ARM64), mejoras en el almacenamiento, mejor monitoreo de sensores y m&#xE1;s.</p><p>Aunque no se trata de</p>]]></description><link>https://sredevops.org/kernel-linux-6-4-ya-disponible/</link><guid isPermaLink="false">649ee5d001f0270001e70f0e</guid><category><![CDATA[Noticias]]></category><category><![CDATA[Destacado]]></category><category><![CDATA[Linux]]></category><dc:creator><![CDATA[Nicolás Georger]]></dc:creator><pubDate>Mon, 26 Jun 2023 17:51:05 GMT</pubDate><media:content url="https://images.unsplash.com/photo-1640552435388-a54879e72b28?crop=entropy&amp;cs=tinysrgb&amp;fit=max&amp;fm=jpg&amp;ixid=M3wxMTc3M3wwfDF8c2VhcmNofDZ8fExJTlVYfGVufDB8fHx8MTY4Nzc3NzE2N3ww&amp;ixlib=rb-4.0.3&amp;q=80&amp;w=2000" medium="image"/><content:encoded><![CDATA[<img src="https://images.unsplash.com/photo-1640552435388-a54879e72b28?crop=entropy&amp;cs=tinysrgb&amp;fit=max&amp;fm=jpg&amp;ixid=M3wxMTc3M3wwfDF8c2VhcmNofDZ8fExJTlVYfGVufDB8fHx8MTY4Nzc3NzE2N3ww&amp;ixlib=rb-4.0.3&amp;q=80&amp;w=2000" alt="Kernel Linux 6.4 ya disponible, incluye soporte para Macs Silicon M2"><p>Llega unos meses despu&#xE9;s del lanzamiento de Linux Kernel 6.3, acorde a lo planificado.</p><p>Esta versi&#xF3;n ofrece muchas mejoras, como la compatibilidad inicial con Apple Silicon M2 (ARM64), mejoras en el almacenamiento, mejor monitoreo de sensores y m&#xE1;s.</p><p>Aunque no se trata de una actualizaci&#xF3;n importante para los usuarios habituales, est&#xE1; dirigida a un grupo espec&#xED;fico de usuarios que desean aprovechar el mejor soporte de hardware/software que se ofrece.</p><p>La versi&#xF3;n 6.3 del Kernel de Linux se prepara para el futuro hardware de Intel y mejora el soporte de chips AMD</p><h2 id="kernel-linux-64-%C2%BFqu%C3%A9-mejoras-trae"><strong>Kernel Linux 6.4: &#xBF;Qu&#xE9; mejoras trae?</strong></h2><p>Recuerda que esta es una versi&#xF3;n no-LTS, por lo que no todo el mundo necesita actualizar a esto a menos que se enfrentan a un problema espec&#xED;fico que esta versi&#xF3;n del kernel corrige o por el simple gusto del <em>bleeding edge</em></p><p>En fin, sigamos. Esta versi&#xF3;n presenta muchas mejoras; algunas notables incluyen:</p><ul><li>Soporte inicial para Apple M2</li><li>Monitorizaci&#xF3;n de sensores mejorada</li><li>Modo aut&#xF3;nomo guiado por AMD P-State</li><li>Mejoras en el almacenamiento</li></ul><p>El Kernel Linux 6.4 presenta soporte inicial para el SoC M2 de Apple, y se le agregaron los archivos DeviceTree para los actuales sistemas MacBook Air, Pro y Mac Mini.</p><p>Aunque el soporte es similar al Apple M1, algunos problemas impiden la salida de pantalla para el Apple M2 Mac Mini, y el soporte para el teclado y el trackpad para los port&#xE1;tiles Apple m&#xE1;s recientes no es funcional.</p><p>Puedes esperar que esto mejore mucho cuando llegue Linux Kernel 6.5.</p><h2 id="monitorizaci%C3%B3n-de-sensores-mejorada">Monitorizaci&#xF3;n de sensores mejorada</h2><p>Similar a la anterior versi&#xF3;n del kernel, Linux Kernel 6.5 cuenta con monitorizaci&#xF3;n de sensores para m&#xE1;s de 100 placas base ASUS. Se trata de variantes tanto Intel como AMD.</p><p>Las placas PRIME, ROG, TUF, Pro, ProArt y m&#xE1;s ahora soportan la monitorizaci&#xF3;n de sensores en Linux. Puedes consultar el pull request para saber m&#xE1;s.</p><p>Modo aut&#xF3;nomo guiado AMD P-State<br>Despu&#xE9;s de muchos esfuerzos, el Modo Aut&#xF3;nomo Guiado de AMD fue integrado en el Kernel de Linux, resultando en un mejor rendimiento y eficiencia energ&#xE9;tica para los procesadores AMD EPYC y AMD Ryzen.</p><p>Para m&#xE1;s detalles sobre esta caracter&#xED;stica, puedes consultar este commit.</p><p>Mejoras en el almacenamiento<br>Linux Kernel 6.4 tambi&#xE9;n presenta bastantes mejoras de almacenamiento que incluyen:</p><p>Mejoras en EROFS, que ahora permite el soporte de bloques subp&#xE1;gina que va bien con la arquitectura AArch64.</p><p>Tambi&#xE9;n hay varias optimizaciones de rendimiento para EXT4 y peque&#xF1;os ajustes para NTFS, que ahora elimina la opci&#xF3;n &quot;Sin reglas de acceso&quot;.</p><p>Adem&#xE1;s, Btrfs y F2FS tambi&#xE9;n han recibido algunas mejoras bastante interesantes, lo que se traduce en un mejor rendimiento para varios casos de uso.</p><h2 id="otros-cambios-y-mejoras">Otros cambios y mejoras</h2><p>Aparte de los cambios mencionados, aqu&#xED; hay algunos que vale la pena destacar:</p><ul><li>Soporte para Intel Linear Address Masking.</li><li>Se ha eliminado la compatibilidad con Intel Thunder Bay.</li><li>Varias optimizaciones para LoongArch.</li><li>Soporte para Intel Lunar Lake HD Audio.</li><li>Mejora del rendimiento de VDUSE.</li><li>Es posible que desee ir a trav&#xE9;s del anuncio de la versi&#xF3;n para ir a trav&#xE9;s de la lista de cambios.</li></ul><h2 id="%C2%BFc%C3%B3mo-instalar-el-kernel-linux-64">&#xBF;C&#xF3;mo instalar el Kernel Linux 6.4?</h2><p>Si est&#xE1; actualizando usando Arch, Fedora, o una distribuci&#xF3;n rolling-release, ser&#xE1; un asunto bastante sencillo para usted. S&#xF3;lo tiene que esperar la actualizaci&#xF3;n del Kernel.</p><p>Pero, si est&#xE1; usando otras distribuciones (Pop!_OS y Linux Lite pueden ser excepciones hasta cierto punto), no recibir&#xE1; una actualizaci&#xF3;n ahora. Normalmente utilizan la versi&#xF3;n de Soporte a Largo Plazo del Kernel de Linux.</p><h2 id="instalar-la-%C3%BAltima-versi%C3%B3n-del-kernel-linux-mainline-en-ubuntu">Instalar la &#xFA;ltima versi&#xF3;n del Kernel Linux Mainline en Ubuntu</h2><p>Este art&#xED;culo muestra c&#xF3;mo actualizar a la &#xFA;ltima versi&#xF3;n del Kernel de Linux en Ubuntu. Hay dos m&#xE9;todos discutidos. Uno es instalar manualmente un nuevo Kernel y el otro utiliza una herramienta GUI que proporciona una manera a&#xFA;n m&#xE1;s f&#xE1;cil.</p><p><br>Gu&#xED;a: (y origen de este art&#xED;culo):</p><figure class="kg-card kg-image-card"><img src="https://itsfoss.com/content/images/size/w256h256/2022/12/android-chrome-192x192.png" class="kg-image" alt="Kernel Linux 6.4 ya disponible, incluye soporte para Macs Silicon M2" loading="lazy"></figure>]]></content:encoded></item><item><title><![CDATA[Inteligencia Artificial vs Bomba Atómica: Oppenheimer y el mensaje de Nolan]]></title><description><![CDATA[<p><em>En cuanto a la IA, el director plantea <strong>una preocupaci&#xF3;n m&#xE1;s profunda sobre IA</strong>: atribuirle caracter&#xED;sticas divinas que nos eximan de la responsabilidad de nuestros actos. &#x201C;Si respaldamos la opini&#xF3;n de que la IA es todopoderosa, estamos respaldando la opini&#xF3;</em></p>]]></description><link>https://sredevops.org/inteligencia-artificial-vs-bomba-atomica-oppenheimer-y-el-mensaje-de-nolan/</link><guid isPermaLink="false">649ee5d001f0270001e70f0d</guid><category><![CDATA[Destacado]]></category><category><![CDATA[Inteligencia Artificial]]></category><category><![CDATA[Cine]]></category><category><![CDATA[Videos]]></category><dc:creator><![CDATA[Nicolás Georger]]></dc:creator><pubDate>Sun, 25 Jun 2023 04:35:24 GMT</pubDate><media:content url="https://images.unsplash.com/photo-1655721530791-59f5bbd64a48?crop=entropy&amp;cs=tinysrgb&amp;fit=max&amp;fm=jpg&amp;ixid=M3wxMTc3M3wwfDF8c2VhcmNofDI1fHxudWNsZWFyJTIwYWl8ZW58MHx8fHwxNjg3NjY3NjI5fDA&amp;ixlib=rb-4.0.3&amp;q=80&amp;w=2000" medium="image"/><content:encoded><![CDATA[<img src="https://images.unsplash.com/photo-1655721530791-59f5bbd64a48?crop=entropy&amp;cs=tinysrgb&amp;fit=max&amp;fm=jpg&amp;ixid=M3wxMTc3M3wwfDF8c2VhcmNofDI1fHxudWNsZWFyJTIwYWl8ZW58MHx8fHwxNjg3NjY3NjI5fDA&amp;ixlib=rb-4.0.3&amp;q=80&amp;w=2000" alt="Inteligencia Artificial vs Bomba At&#xF3;mica: Oppenheimer y el mensaje de Nolan"><p><em>En cuanto a la IA, el director plantea <strong>una preocupaci&#xF3;n m&#xE1;s profunda sobre IA</strong>: atribuirle caracter&#xED;sticas divinas que nos eximan de la responsabilidad de nuestros actos. &#x201C;Si respaldamos la opini&#xF3;n de que la IA es todopoderosa, estamos respaldando la opini&#xF3;n de que puede eximir a las personas de la responsabilidad de sus actos militarmente, socioecon&#xF3;micamente, lo que sea&#x201D;, afirma.</em></p><figure class="kg-card kg-embed-card"><iframe width="200" height="113" src="https://www.youtube.com/embed/uYPbbksJxIg?feature=oembed" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" allowfullscreen title="Oppenheimer | New Trailer"></iframe></figure><p>En el marco del estreno de Oppenheimer el pr&#xF3;ximo 20 de julio, nueva pel&#xED;cula de Christopher Nolan, el director ha establecido una analog&#xED;a entre el momento de creaci&#xF3;n de la bomba at&#xF3;mica y el avance de la inteligencia artificial. La historia del cient&#xED;fico contiene grandes lecciones para nuestros tiempos.</p><p>El reconocido director de cine <strong>Christopher Nolan</strong>, junto con su productora y esposa Emma Thomas, ha despertado <strong>gran expectaci&#xF3;n con su pr&#xF3;xima pel&#xED;cula biogr&#xE1;fica sobre J. Robert Oppenheimer</strong>, el cient&#xED;fico clave en el desarrollo de la bomba at&#xF3;mica.</p><p>En una entrevista exclusiva para<a href="https://www.wired.com/story/christopher-nolan-oppenheimer-ai-apocalypse?ref=sredevops.org"> WIRED</a>, Christopher Nolan comparti&#xF3; <strong>sus pensamientos sobre la &#xE9;poca que vivimos </strong>y su visi&#xF3;n de la inteligencia artificial (IA) tanto en su avance y posibles problemas en el mundo, su potencial en la <a href="https://computerhoy.com/noticias/life/inteligencia-artificial-crea-40000-armas-quimicas-6-horas-1030647?ref=sredevops.org">industria armament&#xED;stica</a>, y sus posibles <a href="https://computerhoy.com/entretenimiento/indiana-jones-5-mostrara-harrison-ford-30-anos-durante-primeros-25-minutos-1236514?ref=sredevops.org">aplicaciones en el cine</a>.</p><p>Nolan, conocido por su pasi&#xF3;n por la ciencia y el cine, destaca la importancia de Oppenheimer y c&#xF3;mo su historia personal se relaciona con los desaf&#xED;os actuales. &#x201C;Es una idea incre&#xED;ble: gente que hace esos c&#xE1;lculos y observa la relaci&#xF3;n entre la teor&#xED;a y el mundo real, y decide que hay una posibilidad muy peque&#xF1;a de que destruyan el mundo entero. Y aun as&#xED; pulsaron el bot&#xF3;n&#x201D;, expres&#xF3; el director.</p><p>Cuando se le mencion&#xF3; la comparaci&#xF3;n entre el desarrollo de la bomba at&#xF3;mica y el crecimiento de la IA generativa, Nolan admiti&#xF3; que existe una analog&#xED;a interesante en cuanto a los peligros de desencadenar irreflexivamente una nueva tecnolog&#xED;a en el mundo. Sin embargo, tambi&#xE9;n se&#xF1;al&#xF3; que la bomba at&#xF3;mica es una tecnolog&#xED;a &#xFA;nica en su capacidad de cambiar y poner en peligro el mundo.</p><p>En cuanto a la IA, el director plantea una preocupaci&#xF3;n m&#xE1;s profunda sobre IA: atribuirle caracter&#xED;sticas divinas que nos eximan de la responsabilidad de nuestros actos. &#x201C;Si respaldamos la opini&#xF3;n de que la IA es todopoderosa, estamos respaldando la opini&#xF3;n de que puede eximir a las personas de la responsabilidad de sus actos militarmente, socioecon&#xF3;micamente, lo que sea&#x201D;, afirma.</p><p>&#x201C;No s&#xE9; cu&#xE1;les son los fundamentos mitol&#xF3;gicos de esto, pero a lo largo de la historia los seres humanos hemos tendido a crear falsos &#xED;dolos, a moldear algo a nuestra propia imagen y decir que tenemos poderes divinos por haberlo hecho&#x201D;, reflexiona. &#x201C;Con estos grandes modelos ling&#xFC;&#xED;sticos, las m&#xE1;quinas podr&#xED;an incluso ser capaces de ense&#xF1;arse a s&#xED; mismas el siguiente paso&#x201D;.</p><p>&#x201C;Tenemos que verla como una herramienta. La persona que la maneja a&#xFA;n tiene que mantener la responsabilidad de manejar esa herramienta, concedemos a la IA el estatus de un ser humano, como en alg&#xFA;n momento hicimos legalmente con las empresas, entonces s&#xED;, vamos a tener enormes problemas&#x201D;, responde.</p><p>En relaci&#xF3;n con la regulaci&#xF3;n en inteligencia artificial, Nolan cuestiona la idea de un &#xF3;rgano de gobierno o una agencia internacional, destacando la compleja relaci&#xF3;n entre la ciencia y gobierno. En este sentido, hizo referencia a la historia de Oppenheimer, quien intent&#xF3; trabajar desde dentro del establishment para regular el poder nuclear, pero finalmente fue aplastado.</p><p>&#x201C;Es el truco pol&#xED;tico m&#xE1;s viejo de las empresas tecnol&#xF3;gicas. &#xBF;Verdad? Zuckerberg lleva a&#xF1;os pidiendo que le regulen. Es el truco pol&#xED;tico m&#xE1;s antiguo. Saben que nuestros cargos electos no pueden entender estos temas&#x201D;, afirma.</p><p>Una lecci&#xF3;n m&#xE1;s en la vida de Oppenheimer que: &#x201C;consideraba que el papel de los cient&#xED;ficos en la posguerra era ser los expertos que ten&#xED;an que averiguar c&#xF3;mo regular este poder en el mundo. Y cuando ves lo que le ocurri&#xF3;, comprendes que nunca se iba a permitir que eso sucediera&#x201D;.</p><p>&#x201C;Intent&#xF3; trabajar desde dentro del establishment. Fue muy pr&#xE1;ctico en su enfoque, pero aun as&#xED; le aplastaron. Es muy complejo, y creo que para nuestros inventores de ahora es muy poco sincero que digan que necesitan que los regulen&#x201D;.</p><p>La sombra del holocausto nuclear sigue vigente<br>Para el director hay una diferencia fundamental entre los a&#xF1;os 40 y hoy: &#x201C;los cient&#xED;ficos que se ocupaban de la divisi&#xF3;n del &#xE1;tomo intentaban explicar al gobierno que la bomba at&#xF3;mica era un hecho de la naturaleza&#x201D;</p><p>&#x201C;Dios lo ha hecho, dec&#xED;a, o el creador o quien quieras que sea. Esto es la Madre Naturaleza. Y as&#xED;, inevitablemente, es solo conocimiento de la naturaleza. Va a ocurrir. No se puede ocultar. No nos pertenece. No la hemos creado. Ellos lo ve&#xED;an as&#xED;.&#x201D;, explica.</p><p>En la juventud del director, la sombra de la destrucci&#xF3;n nuclear a&#xFA;n perduraba: &#x201C;Ser&#xED;a muy dif&#xED;cil argumentar lo mismo sobre la IA. Seguro que algunos lo har&#xE1;n. Pero yo crec&#xED; en los 80 en el Reino Unido, con la Campa&#xF1;a para el Desarme Nuclear. La gente estaba muy, muy concienciada. Cuando ten&#xED;a 13 a&#xF1;os, mis amigos y yo est&#xE1;bamos convencidos de que morir&#xED;amos en un holocausto nuclear&#x201D;.</p><p>La utilizaci&#xF3;n de IA en el cine<br>El aprendizaje autom&#xE1;tico aplicado a la tecnolog&#xED;a deepfake ofrece avances extraordinarios en efectos visuales y audio. Seg&#xFA;n Nolan, estas herramientas ser&#xE1;n poderosas a largo plazo para crear entornos, construir objetos y recopilar datos sobre la interacci&#xF3;n de la luz y los materiales.</p><p>&#x201C;Puede que la IA por fin rompa la barrera entre animaci&#xF3;n y fotograf&#xED;a. Porque es un h&#xED;brido. Si le dices a un artista que, por ejemplo, haga un dibujo de un astronauta, est&#xE1; inventando de memoria o buscando referencias. Con la IA, se trata de un enfoque diferente, en el que utilizas toda la historia de las im&#xE1;genes&#x201D;, analiza.</p><p>Sin embargo, el director, que busca proporcionar una realidad completa a sus actores, tiene una postura selectiva hacia la tecnolog&#xED;a. Considera utilizarla en situaciones peligrosas, como acrobacias, donde se pueden utilizar cables visibles y luego ocultarlos digitalmente, por ejemp lo.</p><p>&#x201C;Saldr&#xE1;n cosas maravillosas, a m&#xE1;s largo plazo, en cuanto a entornos, en cuanto a reunir los datos masivos de c&#xF3;mo son las cosas y c&#xF3;mo reacciona la luz a los materiales. Esas cosas van a ser herramientas enormemente poderosas, pero yo, soy un viejo cineasta anal&#xF3;gico&#x201D;, concluye.</p><p>Fuente: <a href="https://computerhoy.com/entretenimiento/christopher-nolan-afirma-regulacion-ia-truco-1264500?ref=sredevops.org">https://computerhoy.com/entretenimiento/christopher-nolan-afirma-regulacion-ia-truco-1264500</a></p>]]></content:encoded></item><item><title><![CDATA[TED Talks: Cuál será la próxima superpotencia global? Está mucho mas cerca de ti de lo que imaginas]]></title><description><![CDATA[<p>Nuestros roles necesitan comprender sus contextos y el factor pol&#xED;tico, social y cultural es tan impoortante como el t&#xE9;cnico., y c&#xF3;mo los cambios del, entorno o nuestras acciones hoy son parte de una -lametablemente- elite de personas que tienen algunas herrmientas para entender mejor</p>]]></description><link>https://sredevops.org/ted-talks-cual-sera-la-proxima-superpotencia-global-esta-mucho-mas-cerca-de-ti-de-lo-que-imaginas/</link><guid isPermaLink="false">649ee5d001f0270001e70f0b</guid><category><![CDATA[Destacado]]></category><category><![CDATA[Videos]]></category><category><![CDATA[Columnas]]></category><category><![CDATA[Cortos]]></category><dc:creator><![CDATA[Nicolás Georger]]></dc:creator><pubDate>Tue, 20 Jun 2023 09:20:48 GMT</pubDate><media:content url="https://images.unsplash.com/photo-1516280440614-37939bbacd81?crop=entropy&amp;cs=tinysrgb&amp;fit=max&amp;fm=jpg&amp;ixid=M3wxMTc3M3wwfDF8c2VhcmNofDF8fHRlZCUyMHRhbGtzfGVufDB8fHx8MTY4NzI1MjkxNHww&amp;ixlib=rb-4.0.3&amp;q=80&amp;w=2000" medium="image"/><content:encoded><![CDATA[<img src="https://images.unsplash.com/photo-1516280440614-37939bbacd81?crop=entropy&amp;cs=tinysrgb&amp;fit=max&amp;fm=jpg&amp;ixid=M3wxMTc3M3wwfDF8c2VhcmNofDF8fHRlZCUyMHRhbGtzfGVufDB8fHx8MTY4NzI1MjkxNHww&amp;ixlib=rb-4.0.3&amp;q=80&amp;w=2000" alt="TED Talks: Cu&#xE1;l ser&#xE1; la pr&#xF3;xima superpotencia global? Est&#xE1; mucho mas cerca de ti de lo que imaginas"><p>Nuestros roles necesitan comprender sus contextos y el factor pol&#xED;tico, social y cultural es tan impoortante como el t&#xE9;cnico., y c&#xF3;mo los cambios del, entorno o nuestras acciones hoy son parte de una -lametablemente- elite de personas que tienen algunas herrmientas para entender mejor el mundo actual.</p><figure class="kg-card kg-embed-card"><iframe width="200" height="113" src="https://www.youtube.com/embed/uiUPD-z9DTg?feature=oembed" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" allowfullscreen title="The Next Global Superpower Isn&apos;t Who You Think | Ian Bremmer | TED"></iframe></figure><p>Google, Microsoft, Alibaba, Amazon, Apple, etc; son organizaciones tanto o m&#xE1;s poderosas que la mayor&#xED;a de nuestros pa&#xED;sess, y frente a ello, como profesionales que se especializan -entre otras- en implementar desarrollar mantener sus servicios, tecnolog&#xED;as, plataformas (etc), nunca est&#xE1; de m&#xE1;s aprender un poco m&#xE1;s.</p><p>El expositor concluye:<br></p><blockquote><br><br><strong>&#xBF;Est&#xE1;n bien con eso?</strong><br><strong>&#xBF;O van a hacer algo al respecto?</strong><br></blockquote><p>Dale una oportunidad &#xA0;&#x263A;&#xFE0F;</p><p>Transcripci&#xF3;n:</p><div class="kg-card kg-toggle-card" data-kg-toggle-state="close"><div class="kg-toggle-heading"><h4 class="kg-toggle-heading-text"><span>Transcipci&#xF3;n del audio (auto traducido)</span></h4><button class="kg-toggle-card-icon"><svg id="Regular" xmlns="http://www.w3.org/2000/svg" viewbox="0 0 24 24"><path class="cls-1" d="M23.25,7.311,12.53,18.03a.749.749,0,0,1-1.06,0L.75,7.311"/></svg></button></div><div class="kg-toggle-content"></div></div>]]></content:encoded></item><item><title><![CDATA[Cómo desplegar Ghost (CMS/Blog) en Kubernetes]]></title><description><![CDATA[<p>Una soluci&#xF3;n simple para desplegar Ghost CMS en Kubernetes, probado en k3s.</p><figure class="kg-card kg-bookmark-card"><a class="kg-bookmark-container" href="https://github.com/sredevopsdev/ghost-on-kubernetes?ref=sredevops.org"><div class="kg-bookmark-content"><div class="kg-bookmark-title">GitHub - sredevopsdev/ghost-on-kubernetes: Deploy an updated, full Ghost v5.x.x (Blog CMS from @TryGhost) on any Kubernetes (k3s, GKE, AKS, etc)</div><div class="kg-bookmark-description">Deploy an updated, full Ghost v5.x.x (Blog CMS from @TryGhost) on</div></div></a></figure>]]></description><link>https://sredevops.org/como-desplegar-ghost/</link><guid isPermaLink="false">649ee5d001f0270001e70f08</guid><category><![CDATA[Destacado]]></category><category><![CDATA[Apps]]></category><category><![CDATA[Kubernetes]]></category><category><![CDATA[SREDevOps]]></category><dc:creator><![CDATA[Nicolás Georger]]></dc:creator><pubDate>Sun, 11 Jun 2023 09:18:10 GMT</pubDate><media:content url="https://images.unsplash.com/photo-1635001525645-937ff76d7028?crop=entropy&amp;cs=tinysrgb&amp;fit=max&amp;fm=jpg&amp;ixid=M3wxMTc3M3wwfDF8c2VhcmNofDExfHxnaG9zdCUyMGNvb2x8ZW58MHx8fHwxNjg2NDc0MjU2fDA&amp;ixlib=rb-4.0.3&amp;q=80&amp;w=2000" medium="image"/><content:encoded><![CDATA[<img src="https://images.unsplash.com/photo-1635001525645-937ff76d7028?crop=entropy&amp;cs=tinysrgb&amp;fit=max&amp;fm=jpg&amp;ixid=M3wxMTc3M3wwfDF8c2VhcmNofDExfHxnaG9zdCUyMGNvb2x8ZW58MHx8fHwxNjg2NDc0MjU2fDA&amp;ixlib=rb-4.0.3&amp;q=80&amp;w=2000" alt="C&#xF3;mo desplegar Ghost (CMS/Blog) en Kubernetes"><p>Una soluci&#xF3;n simple para desplegar Ghost CMS en Kubernetes, probado en k3s.</p><figure class="kg-card kg-bookmark-card"><a class="kg-bookmark-container" href="https://github.com/sredevopsdev/ghost-on-kubernetes?ref=sredevops.org"><div class="kg-bookmark-content"><div class="kg-bookmark-title">GitHub - sredevopsdev/ghost-on-kubernetes: Deploy an updated, full Ghost v5.x.x (Blog CMS from @TryGhost) on any Kubernetes (k3s, GKE, AKS, etc)</div><div class="kg-bookmark-description">Deploy an updated, full Ghost v5.x.x (Blog CMS from @TryGhost) on any Kubernetes (k3s, GKE, AKS, etc) - GitHub - sredevopsdev/ghost-on-kubernetes: Deploy an updated, full Ghost v5.x.x (Blog CMS fro&#x2026;</div><div class="kg-bookmark-metadata"><img class="kg-bookmark-icon" src="https://github.com/fluidicon.png" alt="C&#xF3;mo desplegar Ghost (CMS/Blog) en Kubernetes"><span class="kg-bookmark-author">GitHub</span><span class="kg-bookmark-publisher">sredevopsdev</span></div></div><div class="kg-bookmark-thumbnail"><img src="https://opengraph.githubassets.com/00ef8e8a7d20b47793aab8255e4059a012fb49d60cbce6ecab515592329adce7/sredevopsdev/ghost-on-kubernetes" alt="C&#xF3;mo desplegar Ghost (CMS/Blog) en Kubernetes"></div></a></figure><h2 id="ghost-en-kubernetes-por-sredevopscl">Ghost en Kubernetes por SREDevOps.cl</h2><p>Este repositorio despliega un CMS Ghost en k3s o cualquier distribuci&#xF3;n de Kubernetes usando kubectl. Se ha probado solo con k3s, la raz&#xF3;n principal es el <strong>almacenamiento</strong>, que se simplifica con k3s.</p><h2 id="notas">Notas:</h2><ul><li><em>Por favor, revisa y edita los archivos en este repositorio seg&#xFA;n tus necesidades.</em></li><li>Ten en cuenta que esto es solo una sugerencia y debes modificarlo para que se ajuste a tus necesidades espec&#xED;ficas.</li><li>Por favor, revisa y edita los archivos seg&#xFA;n tus necesidades.</li></ul><h2 id="caracter%C3%ADsticas">Caracter&#xED;sticas</h2><ul><li>Despliega un CMS Ghost completamente funcional en Kubernetes.</li><li>Admite dominios personalizados y certificados TLS con secrets.</li><li>F&#xE1;cil de usar y mantener.</li></ul><h2 id="requisitos">Requisitos</h2><ul><li>Kubernetes 1.16 o superior.</li><li>k3s 1.20 o superior.</li><li>kubectl</li><li>Conocimientos b&#xE1;sicos sobre Kubernetes</li><li>C&#xF3;mo codificar cadenas en base64</li></ul><h2 id="archivos">Archivos</h2><p>Los siguientes archivos est&#xE1;n incluidos en este repositorio:</p><ul><li>00-namespace.yaml: Crea un espacio de nombres para el despliegue de Ghost.</li><li>01-secrets.yaml: Crea secrets para el despliegue de Ghost. Este archivo debe ser editado de acuerdo a los comentarios que contiene.</li><li>02-mysql.yaml: Despliega una base de datos MySQL para el despliegue de Ghost.</li><li>04-pvc.yaml: Crea una reclamaci&#xF3;n de volumen persistente para el despliegue de Ghost.</li><li>04-service.yaml: Crea un servicio para el despliegue de Ghost.</li><li>05-ghost.yaml: Despliega un pod de Ghost.</li></ul><h2 id="instalaci%C3%B3n">Instalaci&#xF3;n</h2><p>Para instalar Ghost en Kubernetes, sigue estos pasos:</p><ul><li>Clona este repositorio.</li><li>Edita 01-secrets.yaml con tus propios secrets y certificado (yo uso Cloudflare para DNS, por lo que utilizo su certificado y clave proporcionados, b&#xFA;scalo en Google).</li><li>En el directorio ra&#xED;z del repositorio, ejecuta el siguiente comando para desplegar Ghost:</li></ul><pre><code class="language-bash">  kubectl apply -f .
</code></pre><p>Ghost ser&#xE1; desplegado. Puedes acceder a tu CMS Ghost en el puerto predeterminado de Ghost, que es el 2368.</p><h2 id="soluci%C3%B3n-de-problemas">Soluci&#xF3;n de problemas</h2><p>Si tienes problemas al desplegar Ghost en Kubernetes, puedes solucionar el problema siguiendo estos pasos:</p><ul><li>Verifica los registros (logs) del pod de Ghost.</li><li>Verifica la configuraci&#xF3;n de los archivos en este repositorio.</li><li>Crea un issue en este repositorio o busca soporte en &#xA0;<a href="https://foro.sredevops.cl/?ref=sredevops.org">https://sredevops.cl</a></li></ul><h2 id="contribuciones">Contribuciones</h2><p>Si deseas contribuir a este proyecto, sigue estos pasos:</p><ul><li>Haz un fork del repositorio.</li><li>Realiza tus cambios en el c&#xF3;digo.</li><li>Env&#xED;a una pull request.</li></ul>]]></content:encoded></item><item><title><![CDATA[groundcover: monitorea tus apps en kubernetes con menor costo, basado en eBPF]]></title><description><![CDATA[<p><a href="https://docs.groundcover.com/docs/welcome/what-is-groundcover?ref=sredevops.org">groundcover</a> es un servicio pensado para entornos din&#xE1;micos y distribuidos, que permite a los equipos monitorear instant&#xE1;neamente todo lo que construyen y ejecutan en la nube sin necesariamente comprometer el costo, la granularidad o la escala.</p><p>Al utilizar eBPF <em>(<a href="https://ebpf.io/what-is-ebpf/?ref=sredevops.org">&#xBF;qu&#xE9; es eBPF y por</a></em></p>]]></description><link>https://sredevops.org/groundcover-monitorea-tus-apps-en-kubernetes-con-menor-costo-basado-en-ebpf/</link><guid isPermaLink="false">649ee5d001f0270001e70f07</guid><category><![CDATA[Destacado]]></category><category><![CDATA[Kubernetes]]></category><category><![CDATA[Apps]]></category><category><![CDATA[SRE]]></category><dc:creator><![CDATA[Nicolás Georger]]></dc:creator><pubDate>Sat, 10 Jun 2023 17:57:18 GMT</pubDate><media:content url="https://sredevops.org/content/images/2023/06/groundcover.webp" medium="image"/><content:encoded><![CDATA[<img src="https://sredevops.org/content/images/2023/06/groundcover.webp" alt="groundcover: monitorea tus apps en kubernetes con menor costo, basado en eBPF"><p><a href="https://docs.groundcover.com/docs/welcome/what-is-groundcover?ref=sredevops.org">groundcover</a> es un servicio pensado para entornos din&#xE1;micos y distribuidos, que permite a los equipos monitorear instant&#xE1;neamente todo lo que construyen y ejecutan en la nube sin necesariamente comprometer el costo, la granularidad o la escala.</p><p>Al utilizar eBPF <em>(<a href="https://ebpf.io/what-is-ebpf/?ref=sredevops.org">&#xBF;qu&#xE9; es eBPF y por qu&#xE9; debo saberlo?</a>) </em>groundcover logra &quot;observabilidad completa&quot; a nivel nativo en k8s (kubernetes), desde la infraestructura hasta la aplicaci&#xF3;n, en un solo servicio. Te permite acceder a todos los registros de aplicaciones, m&#xE9;tricas, seguimientos y eventos, en un solo lugar y con mayor eficiencia.</p><h3 id="costos">Costos</h3><p><strong>Te permite manejar tu presupuesto, evitando repentinas alzas inesperados en el costo con un precio fijo y predecible </strong>. Dejas de tener la obligaci&#xF3;n de decidir qu&#xE9; &#xE1;rea o feature terndr&#xE1; observabilidad en tu stack y cu&#xE1;l no, gracias a eBPF y la arquitectura de groundcover.</p><h3 id="instalaci%C3%B3n">Instalaci&#xF3;n</h3><p>La instalaci&#xF3;n de groundcover es r&#xE1;pida y parametrizable, tomando alrededor de 1 a 5 minutos.<br>Ofrece un free-tier, suscribi&#xE9;ndote obtienes tu token para el deploy.<br>- Paso 1: &#xA0;<a href="https://app.groundcover.com/?ref=sredevops.org">Suscr&#xED;bete a Groundcover</a><br>- Paso 2: Revisa nuestro video:</p><figure class="kg-card kg-embed-card"><iframe width="200" height="113" src="https://www.youtube.com/embed/NjLYBX4gj1k?feature=oembed" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" allowfullscreen title="SREDevOps: Instalando groundcover en Kubernetes"></iframe></figure><p>M&#xE1;s info:</p><div class="kg-card kg-product-card"><div class="kg-product-card-container"><img src="https://sredevops.org/content/images/2023/06/groundcover.e5b53734b047e0768d5ce60f7baf4475.svg" width="115" height="17" class="kg-product-card-image" loading="lazy" alt="groundcover: monitorea tus apps en kubernetes con menor costo, basado en eBPF"><div class="kg-product-card-title-container"><h4 class="kg-product-card-title">groundcover</h4></div><div class="kg-product-card-rating"><span class="kg-product-card-rating-active kg-product-card-rating-star"><svg xmlns="http://www.w3.org/2000/svg" viewbox="0 0 24 24"><path d="M12.729,1.2l3.346,6.629,6.44.638a.805.805,0,0,1,.5,1.374l-5.3,5.253,1.965,7.138a.813.813,0,0,1-1.151.935L12,19.934,5.48,23.163a.813.813,0,0,1-1.151-.935L6.294,15.09.99,9.837a.805.805,0,0,1,.5-1.374l6.44-.638L11.271,1.2A.819.819,0,0,1,12.729,1.2Z"/></svg></span><span class="kg-product-card-rating-active kg-product-card-rating-star"><svg xmlns="http://www.w3.org/2000/svg" viewbox="0 0 24 24"><path d="M12.729,1.2l3.346,6.629,6.44.638a.805.805,0,0,1,.5,1.374l-5.3,5.253,1.965,7.138a.813.813,0,0,1-1.151.935L12,19.934,5.48,23.163a.813.813,0,0,1-1.151-.935L6.294,15.09.99,9.837a.805.805,0,0,1,.5-1.374l6.44-.638L11.271,1.2A.819.819,0,0,1,12.729,1.2Z"/></svg></span><span class="kg-product-card-rating-active kg-product-card-rating-star"><svg xmlns="http://www.w3.org/2000/svg" viewbox="0 0 24 24"><path d="M12.729,1.2l3.346,6.629,6.44.638a.805.805,0,0,1,.5,1.374l-5.3,5.253,1.965,7.138a.813.813,0,0,1-1.151.935L12,19.934,5.48,23.163a.813.813,0,0,1-1.151-.935L6.294,15.09.99,9.837a.805.805,0,0,1,.5-1.374l6.44-.638L11.271,1.2A.819.819,0,0,1,12.729,1.2Z"/></svg></span><span class="kg-product-card-rating-active kg-product-card-rating-star"><svg xmlns="http://www.w3.org/2000/svg" viewbox="0 0 24 24"><path d="M12.729,1.2l3.346,6.629,6.44.638a.805.805,0,0,1,.5,1.374l-5.3,5.253,1.965,7.138a.813.813,0,0,1-1.151.935L12,19.934,5.48,23.163a.813.813,0,0,1-1.151-.935L6.294,15.09.99,9.837a.805.805,0,0,1,.5-1.374l6.44-.638L11.271,1.2A.819.819,0,0,1,12.729,1.2Z"/></svg></span><span class=" kg-product-card-rating-star"><svg xmlns="http://www.w3.org/2000/svg" viewbox="0 0 24 24"><path d="M12.729,1.2l3.346,6.629,6.44.638a.805.805,0,0,1,.5,1.374l-5.3,5.253,1.965,7.138a.813.813,0,0,1-1.151.935L12,19.934,5.48,23.163a.813.813,0,0,1-1.151-.935L6.294,15.09.99,9.837a.805.805,0,0,1,.5-1.374l6.44-.638L11.271,1.2A.819.819,0,0,1,12.729,1.2Z"/></svg></span></div><div class="kg-product-card-description"><p>monitorea tus apps en kubernetes con menor costo, basado en eBPF</p></div><a href="https://docs.groundcover.com/docs/welcome/what-is-groundcover?ref=sredevops.org" class="kg-product-card-button kg-product-card-btn-accent" target="_blank" rel="noopener noreferrer"><span>ver: groundcover docs</span></a></div></div>]]></content:encoded></item><item><title><![CDATA[PlatformCon 2023: 8 y 9 de Junio, ¡participa!]]></title><description><![CDATA[PlatformCon 2023, es un evento en línea que reúne a profesionales y entusiastas de la tecnología en torno a los conceptos de "Platform Engineering", Site Reliability Engineering y el mundo del cloud computing. ]]></description><link>https://sredevops.org/platformcon-2023/</link><guid isPermaLink="false">649ee5d001f0270001e70f05</guid><category><![CDATA[Platform Engineering]]></category><category><![CDATA[Noticias]]></category><category><![CDATA[Eventos]]></category><dc:creator><![CDATA[Nicolás Georger]]></dc:creator><pubDate>Tue, 06 Jun 2023 23:36:46 GMT</pubDate><media:content url="https://sredevops.org/content/images/2023/08/platform--1-.jpg" medium="image"/><content:encoded><![CDATA[<img src="https://sredevops.org/content/images/2023/08/platform--1-.jpg" alt="PlatformCon 2023: 8 y 9 de Junio, &#xA1;participa!"><p>PlatformCon 2023, es un evento en l&#xED;nea que re&#xFA;ne a profesionales y entusiastas de la tecnolog&#xED;a en torno a los conceptos de &quot;Platform Engineering&quot;, Site Reliability Engineering y el mundo del cloud computing. Durante este evento, podr&#xE1;s explorar las &#xFA;ltimas tendencias en tecnolog&#xED;a, aprender &#xA0;y descubrir sobre c&#xF3;mo fomentar la colaboraci&#xF3;n y la innovaci&#xF3;n en los equipos de desarrollo. Adem&#xE1;s, tendr&#xE1;s la oportunidad de conectarte con comunidades apasionadas y establecer contactos valiosos con empresas l&#xED;deres en la industria. No te pierdas esta experiencia educativa y de networking, reg&#xED;strate ahora en el sitio web oficial de PlatformCon 2022 y &#xFA;nete a la comunidad virtual!</p><p>Puedes ver el programa completo de PlatformCon 2023 y registrarte en el siguiente link:</p><figure class="kg-card kg-bookmark-card"><a class="kg-bookmark-container" href="https://platformengineering.org/?ref=sredevops.org"><div class="kg-bookmark-content"><div class="kg-bookmark-title">The global home for Platform Engineers</div><div class="kg-bookmark-description">Join the #1 platform engineering community. Learn from leading DevOps and cloud native experts. Connect with fellow platform practitioners.</div><div class="kg-bookmark-metadata"><img class="kg-bookmark-icon" src="https://assets.website-files.com/6489de99f6259b6eef4fae4f/6491926133ee9252f3d86b22_favicon-pe.png" alt="PlatformCon 2023: 8 y 9 de Junio, &#xA1;participa!"><span class="kg-bookmark-author">Luca GalanteProduct Humanitec</span></div></div><div class="kg-bookmark-thumbnail"><img src="https://assets.website-files.com/6489de99f6259b6eef4fae4f/64ba7a89996fdf73d1cba081_Home-open-graph.jpg" alt="PlatformCon 2023: 8 y 9 de Junio, &#xA1;participa!"></div></a></figure><figure class="kg-card kg-embed-card"><iframe width="200" height="113" src="https://www.youtube.com/embed/z15oiLGQRYw?feature=oembed" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" allowfullscreen title="Register for PlatformCon 2023 - June 08-09, 2023"></iframe></figure>]]></content:encoded></item><item><title><![CDATA[Nhost: Plataforma opensource alternativa a Firebase]]></title><description><![CDATA[¿Te gustaría tener una plataforma para desarrollar aplicaciones web sin complicaciones? ¡Nhost es tu respuesta! Con Nhost, olvídate de preocuparte por la infraestructura y céntrate en la creación de tu aplicación.]]></description><link>https://sredevops.org/nhost-alternativa-opensource-a-firebase-graphql/</link><guid isPermaLink="false">649ee5d001f0270001e70eff</guid><category><![CDATA[Destacado]]></category><category><![CDATA[Apps]]></category><category><![CDATA[Cloud]]></category><category><![CDATA[Platform Engineering]]></category><dc:creator><![CDATA[Nicolás Georger]]></dc:creator><pubDate>Fri, 02 Jun 2023 22:07:00 GMT</pubDate><media:content url="https://sredevops.org/content/images/2023/06/nhost.png" medium="image"/><content:encoded><![CDATA[<img src="https://sredevops.org/content/images/2023/06/nhost.png" alt="Nhost: Plataforma opensource alternativa a Firebase"><p><em>&#xBF;Te gustar&#xED;a tener una plataforma para desarrollar aplicaciones web sin complicaciones? &#xA1;Nhost es tu respuesta! Con Nhost, olv&#xED;date de preocuparte por la infraestructura y c&#xE9;ntrate en la creaci&#xF3;n de tu aplicaci&#xF3;n.</em></p><p>Una de las cosas <em>bacanes</em> de Nhost es que te ofrece una base de datos PostgreSQL lista para usar. &#xA1;Adi&#xF3;s a las complicaciones de configurar y mantener una base de datos! Adem&#xE1;s, Nhost cuenta con una API f&#xE1;cil de usar, lo que significa que puedes comunicarte con tu base de datos de forma r&#xE1;pida y sencilla, y eso que a&#xFA;n no llegamos a la integraci&#xF3;n nativa con GraphQL.</p><p><em>Y por si fuera poco...</em>. Nhost tambi&#xE9;n te brinda m&#xE1;s de 10 opciones para implementar providers de autenticaci&#xF3;n segura para tus usuarios. Puedes implementar f&#xE1;cilmente funciones de inicio de sesi&#xF3;n, registro y gesti&#xF3;n de usuarios en tu aplicaci&#xF3;n sin tener que lidiar con la seguridad t&#xFA; mismo. &#xA0;oAuth2 desde Github, Auth0, Google, entre otros.</p><p>&#xBF;Recuerdas las veces que tu aplicaci&#xF3;n se ca&#xED;a por tr&#xE1;fico? Nhost (versi&#xF3;n cloud) ofrece escalabilidad autom&#xE1;tica, lo que significa que tu aplicaci&#xF3;n se ajustar&#xE1; &#xA0;a cualquier cantidad de usuarios sin que se caiga ni tee deje <em>con m&#xE1;s lag que manco con VTR.</em></p><p>Y si eres fan&#xE1;tico del desarrollo frontend moderno, Nhost tambi&#xE9;n tiene algo para ti. Puedes utilizar Next.js y React Native para crear tu interfaz de usuario, y Nhost se encargar&#xE1; de la parte del backend. &#xA1;La combinaci&#xF3;n perfecta para una experiencia de desarrollo fluida!</p><p>As&#xED; que ah&#xED; lo tienes, Nhost es la plataforma perfecta para desarrollar aplicaciones web de manera sencilla y sin preocupaciones. Con su base de datos lista para usar, autenticaci&#xF3;n segura, escalabilidad autom&#xE1;tica y soporte para frontend moderno, tendr&#xE1;s foco en tu proyecto y en tu c&#xF3;digo.</p><p>Menci&#xF3;n aparte, es que puedes usar un free tier razonable y menco&#xF3;n aparte para esos SRE que est&#xE1;n leyendo, ofrece opci&#xF3;n <em>self managed </em>a trav&#xE9;s de containers y docker-compose, pero el trabajo de migrar hacia un deployment acorde a tu necesidad, queda a tu disposici&#xF3;n.</p><figure class="kg-card kg-bookmark-card kg-card-hascaption"><a class="kg-bookmark-container" href="https://github.com/nhost/nhost.git?ref=sredevops.org"><div class="kg-bookmark-content"><div class="kg-bookmark-title">GitHub - nhost/nhost: The Open Source Firebase Alternative with GraphQL.</div><div class="kg-bookmark-description">The Open Source Firebase Alternative with GraphQL. - GitHub - nhost/nhost: The Open Source Firebase Alternative with GraphQL.</div><div class="kg-bookmark-metadata"><img class="kg-bookmark-icon" src="https://github.com/fluidicon.png" alt="Nhost: Plataforma opensource alternativa a Firebase"><span class="kg-bookmark-author">GitHub</span><span class="kg-bookmark-publisher">nhost</span></div></div><div class="kg-bookmark-thumbnail"><img src="https://repository-images.githubusercontent.com/337414495/136c2bf7-b665-4f16-a20d-3c821cb89072" alt="Nhost: Plataforma opensource alternativa a Firebase"></div></a><figcaption>nhost repositorio en Github</figcaption></figure>]]></content:encoded></item></channel></rss>